{"pageProps":{"post":{"slug":"bringing-firecracker-to-jenkins","fileName":"2025-10-13-bringing-firecracker-to-jenkins.md","contentHtml":"<p>In this post, we'll introduce actuated's new Firecracker plugin for Jenkins and why you should consider it over the existing plugins for Docker, Kubernetes, EC2, or GCE.</p>\n<p>To say that <a href=\"https://en.wikipedia.org/wiki/Jenkins_(software)\">Jenkins</a> is a staple in the CI/CD world would be an understatement. This project was first released under the name <a href=\"https://en.wikipedia.org/wiki/Hudson_(software)\">Hudson</a> in 2004 as a side project by Kohsuke Kawaguchi while working at Sun Microsystems. It has since evolved into one of the most widely used automation and build tools in the industry.</p>\n<p>Just as when the World Wide Web was in its infancy, TLS termination and encrypted messages were the stuff of fiction - so were highly privileged daemons like Docker, and specialised tasks like building and loading Kernel modules into a build environment. Build environments were rarely immutable, ephemeral or hermetic.</p>\n<p>In 2025 there are now a range of ways to make the build environment for Jenkins known as a \"slave\" or by more modern terminology a \"runner\" - ephemeral and less prone to side-effects. Whilst not natively implemented in Jenkins, the Docker, Kubernetes, GCE and EC2 plugins all provide a way to launch a build environment that is isolated from the Jenkins master and other builds.</p>\n<p>But there are limits and tradeoffs to these approaches.</p>\n<p><strong>Kubernetes Plugin</strong></p>\n<p>I was recently speaking to a friend at jFrog which has a large self-hosted instance of Jenkins. He told me that using the <a href=\"https://plugins.jenkins.io/kubernetes/\">Kubernetes executor</a>, there were delays of between 1 and 5 minutes for each job, and that Pods had to run in privileged mode to allow Docker-in-Docker builds. This is a significant security risk, and one that many organisations are not comfortable with.</p>\n<p><img src=\"/images/2025-10-slicer-jenkins/k8s-plugin.png\" alt=\"Kubernetes plugin\"></p>\n<blockquote>\n<p>The Kubernetes plugin is inherently vulnerable to privilege escalation attacks when using a Privileged Pod or containers with root.</p>\n</blockquote>\n<p>Scaling: Can request new nodes as required via Cluster Autoscaler, but this can add 1-2 minutes to launch time.\nSpeed: Slow, in real world scenarios this can take 1-5 minutes to launch a Pod.\nSecurity: Medium if no Pod is allowed to run as root, or access Docker in any way. More usual rating is Low - all Pods run as root or a privileged Pod.</p>\n<p>In high concurrency scenarios - Kubernetes rate-limits Pod launches. I just got off the phone with a customer who regularly launches 400-500 concurrent builds and couldn't understand why GitHub's Kubernetes solution could take up to 10 minutes to schedule all of the builds.</p>\n<p>The readability of Kubernetes pipeline syntax is challenging and custom container images are required, which need to kept up to date (something that many teams struggle with).</p>\n<pre><code>podTemplate(\n  agentContainer: 'maven',\n  agentInjection: true,\n  containers: [\n    containerTemplate(name: 'maven', image: 'maven:3.9.9-eclipse-temurin-17'),\n    containerTemplate(name: 'golang', image: 'golang:1.16.5', command: 'sleep', args: '99d')\n  ]) {\n\n    node(POD_LABEL) {\n        stage('Get a Maven project') {\n            git 'https://github.com/jenkinsci/kubernetes-plugin.git'\n            container('maven') {\n                stage('Build a Maven project') {\n                    sh 'mvn -B -ntp clean install'\n                }\n            }\n        }\n\n        stage('Get a Golang project') {\n            git url: 'https://github.com/hashicorp/terraform.git', branch: 'main'\n            container('golang') {\n                stage('Build a Go project') {\n                    sh '''\n                    mkdir -p /go/src/github.com/hashicorp\n                    ln -s `pwd` /go/src/github.com/hashicorp/terraform\n                    cd /go/src/github.com/hashicorp/terraform &#x26;&#x26; make\n                    '''\n                }\n            }\n        }\n\n    }\n}\n</code></pre>\n<p><strong>Docker Plugin</strong></p>\n<p>If you've ever touched Jenkins for work, then you're likely familiar with the <a href=\"https://www.jenkins.io/doc/book/pipeline/docker/\">Docker plugin</a>. It can either create a container for each build, or use a long-running container as a build environment. The former is more secure, but can be slow to start up, especially if the image is large or needs to be pulled from a remote registry. The latter is faster, but can lead to side-effects building up over time and is vulnerable to malware, unintentional changes, and ransomware attacks</p>\n<p><img src=\"/images/2025-10-slicer-jenkins/docker-plugin.png\" alt=\"Docker plugin\"></p>\n<blockquote>\n<p>The Docker plugin is a misnomer, sharing a Docker Socket, running in Privileged mode, or exposing a TCP socket means there are no boundaries or isolation between the builds and the host.</p>\n</blockquote>\n<p>Whilst working with Intel on their CI/CD infrastructure, an engineer shared the woes of trying to get Docker itself to work within a build slave due to incompatible settings between Docker on the host and within Jenkins.</p>\n<p>Docker runs as root, with the socket mounted, or exposed over TCP (even worse).</p>\n<p>Scaling: By default scales across only one host - difficult to cluster and use a dynamic pool of hosts.\nSecurity: Low. Docker is running as root, the socket is mounted or exposed over TCP.</p>\n<p>The Docker Pipeline plugin is slightly less verbose than the Kubernetes plugin, but suffers from the same issue. These pinned images tend to get out of date quickly, and need to be maintained. Enterprise companies are also likely to customise them for their own needs further exacerbating the problem.</p>\n<pre><code>pipeline {\n    agent {\n        docker {\n            image 'maven:3.9.9-eclipse-temurin-21'\n            args '-v $HOME/.m2:/root/.m2'\n        }\n    }\n    stages {\n        stage('Build') {\n            steps {\n                sh 'mvn -B'\n            }\n        }\n    }\n}\n</code></pre>\n<p><strong>EC2 / GCE Plugins</strong></p>\n<p>These plugins can run in one-shot or reusable modes. In the one-shot mode, you get a new VM launched which lasts for just one job, but it has a tradeoff. It takes at least 1 minute to launch the most stripped down minimal VM on <a href=\"https://plugins.jenkins.io/ec2/\">AWS EC2</a>, so job queue times are likely to be high. In reusable mode, the VM is kept alive for a period of time, and can be reused for multiple jobs. This is faster, but can lead to side-effects building up over time making it as bad as the long-running Docker container approach.</p>\n<p>Scaling: If set to one-shot mode, a new host is created for each build 1-2 minutes of lead time. In reusable mode (default) a host is reused for multiple builds until it becomes idle and can then be terminated.\nSpeed: Slow - at least 1 minute to launch a minimal VM.\nSecurity: (If configured for one VM per job) High. VMs are isolated from each other, and can be launched with minimal privileges. Low if reused.\nConfiguration: Complex - requires managing AMIs, SSH keys, and network configuration. Many configuration options for the plugin to get it to work \"right\".</p>\n<p><strong>Summing up issues with existing plugins</strong></p>\n<ul>\n<li>Slow to boot fresh environments</li>\n<li>Likely runs as root, with a Privileged Pod or Docker socket mounted</li>\n<li>Side-effects build up over time</li>\n<li>Complex configuration</li>\n<li>In high concurrency scenarios - Kubernetes rate-limits Pod launches</li>\n<li>Difficult to maintain custom images and infrastructure required for the plugins to work</li>\n</ul>\n<p>Beware of the copious amounts of guides on sites like Medium.com and Dev.to that encourage you to take shortcuts and set up long-running, reusable build slaves. It's not 2004 anymore, and this approach is fraught with risk.</p>\n<p>For a deeper dive into why the CNCF and Ampere choose Actuated and Firecracker for building OSS projects over GitHub's own supported solution, read: <a href=\"https://actuated.com/blog/how-secure-are-containers-vs-microvms-ci\">How secure are containers &#x26; Kubernetes vs. microVMs for self-hosted CI?</a>.</p>\n<h2 id=\"a-next-gen-approach\">A Next-Gen Approach</h2>\n<p>Compared to the approaches above, which all feel like retrofits to an architecture built in the early 2000s, Firecracker is a modern, lightweight virtualisation technology that was open-sourced by AWS in 2018. It is designed to run serverless workloads and container workloads with minimal overhead, and provides strong isolation between workloads.</p>\n<p><img src=\"/images/2025-10-slicer-jenkins/slicer-plugin.png\" alt=\"Firecracker architecture\"></p>\n<blockquote>\n<p>Pictured: The Jenkins plugin for Slicer makes two REST calls over HTTP to start up two VMs for the requested builds.</p>\n</blockquote>\n<p><strong>The CNCF and Ampere Computing choose Actuated over Kubernetes</strong></p>\n<p>If you've heard of our work with actuated, then you'll know that the <a href=\"https://amperecomputing.com/blogs/ampere-computing-and-cncf-supporting-arm-native-ci-for-ncf-projects\">CNCF and Ampere Computing partnered to choose Actuated</a> instead of GitHub's own Actions Runtime Controller (ARC) to run GitHub Actions for top-tier CNCF projects needing Arm compute. Over a period of 18 months, over 3 million CI jobs were run for Open Telemetry, runc, containerd, etcd, and many others.</p>\n<p>Why? Primarily, ARC means managing a Kubernetes cluster with highly privileged Pods, so that common tools like Docker can be used in CI jobs. It has limitations to what will run - so you can't build and load a Kernel module like you can in Firecracker. You can't run a Kubernetes cluster to test your images - not safely, and not quickly. Docker in Docker relies on the VFS plugin aka \"native snapshotter\" which is up to 5-10x slower than overlayfs.</p>\n<p>Firecracker has a headline of being able to launch a microVM in 125ms, but anyone who has used it for real world tasks knows that it'll be a good 1s to boot up a full build image with systemd and Docker preinstalled. Not at all shabby compared to the alternatives explored above.</p>\n<p>So Firecracker, or microVMs more broadly give us:</p>\n<ul>\n<li>Full isolation of every build</li>\n<li>Fast start up time - 1s even with a bloated build image containing systemd, Docker, and other common build tools</li>\n<li>Run Docker and Kubernetes as root without risk</li>\n<li>Run apt-get, yum, dnf, zypper, etc with no side-effects</li>\n<li>Build, and load Kernel modules without risk or compatibility issues with the host</li>\n<li>Run untrusted code safely</li>\n</ul>\n<h2 id=\"introducing-the-slicer-plugin-for-jenkins-by-actuatedcom\">Introducing the Slicer Plugin for Jenkins by Actuated.com</h2>\n<p>Instead of adding Jenkins support directly to actuated, we took a slightly different approach. We span out the internals of actuated into a general purpose VM orchestrator tool called <a href=\"https://slicervm.com\">SlicerVM.com</a>. Then, we built a native Java plugin for a Cloud implementation just like the EC2, GCE, and Kubernetes plugins that launches microVMs on demand.</p>\n<p>This was not a task for the feint of heart - for one it requires extensive use of Java, and two many undocumented and mysterious Jenkins-specific APIs, which run into race conditions and other oddities.</p>\n<p>So for our friend working at an enterprise company, where Jenkins is firmly rooted and likely to be just as entrenched within the next 5 years, this plugin provides a way to run builds in microVMs with the mentioned benefits of lower queued times, running privileged commands the normal way - apt/dnf/yum/zypper, Docker, Kubernetes, etc.</p>\n<p>That's enough about how it works and why it's better, let's see it in action on YouTube:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LSUVBGfzf3s?si=Ise4t8vbMuX8ss_b\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n<p>To get started, you need one or more machines capable of running KVM, with a Linux OS installed. We recommend Ubuntu Server LTS, however other RHEL-like operating systems also work.</p>\n<p>You can use bare-metal in the cloud (i.e. Hetzner), or within your own datacenter, or within a VM where nested virtualisation is available i.e. VMware, OpenStack, or Azure, GCE, DigitalOcean, Oracle Cloud, etc.</p>\n<p>For teams that are only able to procure from AWS, the options for bare-metal are a bit more limited, but we are starting work to make <a href=\"https://blog.alexellis.io/how-to-run-firecracker-without-kvm-on-regular-cloud-vms/\">KVM-PVM</a> more broadly available to our customers so you can run KVM with pagetable isolation on existing EC2 instances.</p>\n<p><strong>Example pipeline builds</strong></p>\n<p>Pipeline builds need no specific changes other than a build agent label, so that the plugin knows when a new microVM is required.</p>\n<p>Example build using Docker:</p>\n<pre><code>pipeline {\n  agent { label 'slicer'}\n  options { timeout(time: 2, unit: 'MINUTES') }\n  \n  stages {\n    stage('Build') { steps { sh '''\nsudo systemctl start docker\ndocker run -i alpine:latest ping -c 4 google.com\n    ''' } }\n  }\n}\n</code></pre>\n<p>Example End to End test using Kubernetes:</p>\n<pre><code>pipeline {\n  agent { label 'slicer'}\n  options { timeout(time: 2, unit: 'MINUTES') }\n  \n  stages {\n    stage('Build') { steps { sh '''\nexport PATH=$PATH:$HOME/.arkade/bin\n\narkade get k3sup kubectl --progress=false\n\nexport KUBECONFIG=`pwd`/kubeconfig\n\nk3sup install --local --no-extras\nk3sup ready --attempts 5 --pause 100ms\n\nkubectl get nodes -o wide\nkubectl get pods -A -o wide\n''' } }\n  }\n\n}\n</code></pre>\n<p>We used K3sup to setup the cluster, but kubeadm, KinD, minikube, K3d, minikube, Openshift's CRC, or any other local Kubernetes solution will work in exactly the same way.</p>\n<p>Just like with actuated, custom VM sizes can be allocated without creating predefined sets: <code>slicer-2cpu-gb</code> or <code>slicer-8cpu-16gb</code> for example.</p>\n<p>You can also customise the image to pre-install Docker, the latest JVM version, or whatever tooling you're used to obtaining from your in-house golden images.</p>\n<h2 id=\"next-steps\">Next steps</h2>\n<p>To try out Slicer for Jenkins, sign up for a personal or commercial subscription at <a href=\"https://slicervm.com\">SlicerVM.com</a> and let us know that you'd like to receive the plugin. Each server requires a seat, however there is no limit on how large you want to make your server, so one machine can run a significant number of concurrent builds.</p>\n<p>If it's too early for you to embark on a self-service Proof Of Concept, then you can <a href=\"https://forms.gle/8XmpTTWXbZwWkfqT6\">contact us for more a brief call and demo via Zoom</a>. The form mentions GitHub Actions, so feel free to use the free text box to let us know you're interested in Jenkins support.</p>\n<h3 id=\"glossary\">Glossary</h3>\n<p>What's KVM?</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Kernel-based_Virtual_Machine\">KVM</a> is a Linux kernel module that allows the kernel to function as a hypervisor. It requires a CPU with hardware virtualisation extensions such as Intel VT-x or AMD-V. KVM can also run on many cloud or on-premises VMs where nested virtualisation is enabled.</p>\n<p>What's KVM-PVM?</p>\n<p><a href=\"https://blog.alexellis.io/how-to-run-firecracker-without-kvm-on-regular-cloud-vms/\">KVM-PVM</a> is a patch led by Alibaba Cloud and Ant Group which allows KVM to run with pagetable isolation on CPUs without hardware virtualisation extensions.</p>\n<p>What's Firecracker?</p>\n<p><a href=\"https://firecracker-microvm.github.io/\">Firecracker</a> is an open-source virtualisation technology that runs lightweight microVMs with minimal overhead. It was open-sourced by AWS in 2018 and is used to run AWS services like Lambda and Fargate.</p>\n<p>What's actuated?</p>\n<p><a href=\"https://actuated.com\">Actuated.com</a> is a managed service for running GitHub Actions and other CI/CD workloads in Firecracker microVMs. You Bring Your Own Cloud (BYOC) and it handles the orchestration, scaling, image management, and security of your runners.</p>\n<p>What's Slicer?</p>\n<p><a href=\"https://slicervm.com\">SlicerVM.com</a> was spun out of actuated to provide a general purpose YAML or API-driven orchestration tool for Firecracker. You can use it launch one-shot tasks like CI runners, or long-lived services like Kubernetes, web-servers, databases, etc.</p>","title":"Fast and Secure Jenkins Builds with Firecracker","description":"Learn about our new plugin to make Jenkins builds faster, more secure, and easier to manage.","tags":["jenkins","enterprise","cicd","security","docker","kubernetes"],"author_img":"alex","image":"/images/2025-10-slicer-jenkins/background.png","date":"2025-10-13"}},"__N_SSG":true}