{"pageProps":{"post":{"slug":"burst-billing-capacity","fileName":"2024-05-01-burst-billing-capacity.md","contentHtml":"<p><a href=\"/blog/blazing-fast-ci-with-microvms\">Why did we make Actuated</a>? Actuated provides a securely isolated, managed, white-glove experience for customers who want to run CI/CD on GitHub Actions, with access to fast and private hardware. It's ideal for moving your organisation off Jenkins, customers who spend far too much on hosted runners, or those who cringe at the security implications of building with Docker using Kubernetes.</p>\n<p>Today, we're introducing two new features for actuated customers: burst billing and burst capacity (on shared servers). With burst billing, you can go over the concurrency limit of your plan for the day, and pay for the extra usage at a slightly higher rate. With burst capacity, you can opt into running more jobs than your current pool of servers allow for by using our hardware.</p>\n<p><strong>Why we charge on concurrency, not minutes</strong></p>\n<p>Having run over 320k VMs for customer CI jobs on GitHub Actions, we've seen a lot of different workloads and usage patterns. Some teams have a constant stream of hundreds of jobs per hour due to the use of matrix builds, some have a plan that's a little to big for them, and others have a plan that's a little to small, so they get the odd delay whilst they wait for jobs to finish.</p>\n<p>We decided to charge customers based not upon how many jobs they launched, how many minutes they consumed, but on the maximum amount of jobs they wanted to run at any one time (concurrency). Since customers already bring their own hardware, and pay per minute, hour or month for it, we didn't want them to have to pay again per minute and to be limited by how many jobs they could run per month.</p>\n<p>For high usage customers, this is a great deal. You get to run unlimited minutes, and in one case we had a customer who consumed 100k minutes within one week. With GitHub's current pricing that would have cost them 3,200 USD per week, or 12,800 USD per month. So you can see how <a href=\"/pricing\">the actuated plans</a>, based upon concurrency alone are a great deal cheaper here.</p>\n<p><strong>What if your plan is too small?</strong></p>\n<p>So let's take a team that has the 5 concurrent build plan, but their server can accommodate 10 builds at once. What happens there?</p>\n<p>If 8 builds are queued, 5 will be scheduled, and the other 3 will remain in a queue. Once one of the first 5 completes, one of those 3 pending will get scheduled, and so forth, until all the work is done.</p>\n<p><img src=\"/images/2024-05-burst/limited.png\" alt=\"Concurrency limiting in practice\"></p>\n<blockquote>\n<p>The plan size is 5, but there are 8 jobs in the queue. The first 5 are scheduled, and the other 3 are pending.</p>\n</blockquote>\n<p>Prior to today, the team would have only had two options: stay on the 5 concurrent build plan, and just accept that sometimes they'll have to wait for builds to complete, or upgrade to the 10 concurrent build plan, and have that extra capacity available to them whenever it's needed.</p>\n<p><strong>CI usage can be unpredictable</strong></p>\n<p>In the world of Kubernetes and autoscaling Pods, it might seem counterintuitive to plan out your capacity, but what we've seen is that when it comes to CI/CD, the customers we've worked with so far have very predictable usage patterns and can help them right-size their servers and plans.</p>\n<p>As part of our white-glove service, we monitor the usage of customers to see when they're hitting their limits, or encountering delays. We'll also let them know if they are under or overutilising their servers based upon free RAM and CPU usage.</p>\n<p>Then, there are two additional free tools we offer for self-service:</p>\n<ul>\n<li>Our open-source <a href=\"https://actuated.dev/blog/github-actions-usage-cli\">actions-usage</a> tool can give you a good idea of what your patterns look like for a given period of time.</li>\n<li>We built <a href=\"https://actuated.dev/blog/right-sizing-vms-github-actions\">vmmeter</a> to help customers right-size VMs to CI jobs. So often customers pick VM sizes that are an order of magnitude too big for their jobs, meaning fewer jobs can run in parallel on the same set of servers</li>\n</ul>\n<p><strong>Extra billing on your own servers</strong></p>\n<p>If you're on a plan that has 20 concurrent builds, and it's \"Release day\", which means you ideally need 40 concurrent builds, but only for that day, it doesn't make sense to upgrade to a 40 concurrent build plan for the whole month. So we've introduced billing for burst billing where you pay extra for the extra concurrency you use, but only for the days in which you use it.</p>\n<p>This is a great way to get the extra capacity you need, without having to pay for it all the time, you'll need to have the extra capacity available on your own servers, but we can help you set that up.</p>\n<p>In the below diagram, the customer is on a 5 concurrent build plan, but is bursting to 8 builds on his own servers.</p>\n<p><img src=\"/images/2024-05-burst/burst-billing.png\" alt=\"Burst billing\"></p>\n<blockquote>\n<p>Make use of excess capacity on your own servers for a day, without increasing your plan size for the whole month.</p>\n</blockquote>\n<p><strong>Extra concurrency on our servers</strong></p>\n<p>At no extra cost, we're offering burst capacity for customers who need it onto hardware which we run. This is turned off by default, so you'll have to ask us to access, but once it's available, you'll be able to run more jobs than your servers allow for. When you use our servers, you'll be billed for burst concurrency, which is slightly higher than the normal rate.</p>\n<p>Below, the customer has used up the capacity of her own servers and is now bursting onto our servers for 2x <em>x86_64</em> and 2x Arm builds.</p>\n<p><img src=\"/images/2024-05-burst/actuated-servers.png\" alt=\"Use our servers\"></p>\n<blockquote>\n<p>Make use of our servers to run more jobs than your servers allow for.</p>\n</blockquote>\n<h2 id=\"wrapping-up\">Wrapping up</h2>\n<p>If you'd like to try burst billing on your own servers, where you pay a little more on the days where you need to go over your plan, or if you'd like to use our server capacity to be able to keep the number of servers you run down, then please get in touch with us via the actuated Slack.</p>\n<p><strong>How much extra is burst billing?</strong></p>\n<p>Burst billing when used for spiky workloads is far cheaper than upgrading your plan for the whole month. The launch rate is 40%, however this may be subject to change.</p>\n<p><strong>What if we go over the plan every day?</strong></p>\n<p>If you go over the plan every day, or most days, then it may be cheaper to upgrade to the next plan size. For instance, if the average daily usage is 14 builds, and your plan size is 10, you should save money by adopting the 15 build plan.</p>\n<p>That said, if your plan size is 10, and the monthly average is 12, you'll be better off with burst billing.</p>\n<p><strong>Can we set a limit on burst billing?</strong></p>\n<p>Burst billing is off by default. You can set an upper bound on the amount by telling us how high you want to go.</p>\n<p><strong>How do we get burst capacity with actuated servers?</strong></p>\n<p>Tell us the burst limit you'd like to enable, then we can enable <em>x86_64</em> or <em>Arm64</em> server capacity on your account.</p>\n<p><strong>When is burst capacity used?</strong></p>\n<p>Burst capacity is used when a job cannot be scheduled onto your own server capacity, and there is available capacity on our servers. Another way to think about burst capacity is as using on shared servers. Each job runs in its own microVM, which provides hard isolation.</p>\n<p>You may also like:</p>\n<ul>\n<li><a href=\"/blog/right-sizing-vms-github-actions\">Right-sizing VMs for GitHub Actions</a></li>\n<li><a href=\"/blog/github-actions-usage-cli\">Measure your GitHub Actions usage</a></li>\n<li><a href=\"/blog/cncf-arm-march-update\">The state of Arm CI for the CNCF</a></li>\n</ul>","title":"Introducing burst billing and capacity for GitHub Actions","description":"Actuated now offers burst billing and capacity for customers with spiky and unpredictable CI/CD workloads.","tags":["githubactions","cicd","burst","capacity","billing"],"author_img":"alex","image":"/images/2024-05-burst/background.png","date":"2024-04-25"}},"__N_SSG":true}