{"pageProps":{"post":{"slug":"managing-github-actions","fileName":"2023-03-31-managing-github-actions.md","contentHtml":"<p>Over the past few months, we've launched over 20,000 VMs for customers and have handled over 60,000 webhook messages from the GitHub API. We've learned a lot from every customer PoC and from our own usage in OpenFaaS.</p>\n<p>First of all - what is it we're offering? And how is it different to managed runners and the self-hosted runner that GitHub offers?</p>\n<p>Actuated replicates the hosted experience you get from paying for hosted runners, and brings it to hardware under your own control. That could be a bare-metal Arm server, or a regular Intel/AMD cloud VM that has nested virtualisation enabled.</p>\n<p>Just like managed runners - every time actuated starts up a runner, it's within a single-tenant virtual machine (VM), with an immutable filesystem.</p>\n<p><a href=\"https://twitter.com/alexellisuk/status/1641471236738875399/photo/1\"><img src=\"https://pbs.twimg.com/media/FsesfBIWAAEYjGY?format=jpg&#x26;name=large\" alt=\"The Asahi Linux lab\"></a></p>\n<blockquote>\n<p>Asahi Linux running on my lab of two M1 Mac Minis - used for building the Arm64 base images and Kernels.</p>\n</blockquote>\n<p>Can't you just use a self-hosted runner on a VM? Yes, of course you can. But it's actually more nuanced than that. The self-hosted runner <a href=\"https://actuated.dev/blog/is-the-self-hosted-runner-safe-github-actions\">isn't safe</a> for OSS or public repos. And whether you run it directly on the host, or in Kubernetes - it's subject to side-effects, poor isolation, malware and in some cases uses very high privileges that could result in taking over a host completely.</p>\n<p>You can learn more in the <a href=\"https://actuated.dev/blog/blazing-fast-ci-with-microvms\">actuated announcement</a> and <a href=\"https://docs.actuated.dev/faq\">FAQ</a>.</p>\n<h2>how does it work?</h2>\n<p>We run a SaaS - a managed control-plane which is installed onto your organisation as a GitHub App. At that point, we'll receive webhooks about jobs in a queued state.</p>\n<p><img src=\"/images/2023-03-lessons-learned/conceptual.jpg\" alt=\"Conceptual architecture\"></p>\n<p>As you can see in the diagram above, when a webhook is received, and we determine it's for your organisation, we'll schedule a <a href=\"https://firecracker-microvm.github.io/\">Firecracker</a> MicroVM on one of your servers.</p>\n<p>We have no access to your code or build secrets. We just obtain a registration token and send the runner a bit of metadata. Then we get out the way and let the self-hosted runner do its thing - in an isolated Kernel, with an immutable filesystem and its own Docker daemon.</p>\n<p>Onboarding doesn't take very long - you can use your own servers or get them from a cloud provider. We've got a <a href=\"https://docs.actuated.dev/provision-server/\">detailed guide</a>, but can also recommend an option on a discovery call.</p>\n<p>Want to learn more about how Firecracker compares to VMs and containers? <a href=\"https://www.youtube.com/watch?v=CYCsa5e2vqg\">Watch my webinar on YouTube</a></p>\n<h2>Lesson 1 - GitHub's images are big and beautiful</h2>\n<p>The first thing we noticed when building our actuated VM images was that the GitHub ones are huge.</p>\n<p>And if you've ever tried to find out how they're built, or hoped to find a nice little Dockerfile, you can may be disappointed. The images for Linux, Windows and MacOS are built <a href=\"https://github.com/actions/runner-images\">through a set of bespoke scripts</a>, and are hard to adapt for your own use.</p>\n<p>Don't get me wrong. The scripts are very clever and they work well. GitHub have been tuning these runner images for years, and they cover a variety of different use-cases.</p>\n<p>The first challenge for actuated before launching a pilot was getting enough of the most common packages installed through a Dockerfile. Most of our own internal software is built with Docker, so we can get by with quite a spartan environment.</p>\n<p>We also had to adapt the sample Kernel configuration provided by the Firecracker team so that it could launch Docker and so it had everything it required to launch <a href=\"https://twitter.com/alexellisuk/status/1641476545695952905?s=20\">Kubernetes</a>.</p>\n<p><a href=\"https://twitter.com/alexellisuk/status/1641476545695952905/photo/1\"><img src=\"https://pbs.twimg.com/media/FseyAyWXsAQJBCe?format=png&#x26;name=large\" alt=\"M1s running Firecracker\"></a></p>\n<blockquote>\n<p>Two M1 Mac Minis running Asahi Linux and four separate versions of K3s</p>\n</blockquote>\n<p>So by following the 80/20 principle, and focusing on the most common use-cases, we were able to launch quite quickly and cover 80% of the use-cases.</p>\n<p>I don't know if you realised, things like Node.js are pre-installed in the environment, but many Node developers also add the \"setup-node\" action which guess what? Downloads and installs Node.js again. The same is true for many other languages and tools. We do ship Node.js and Python in the image, but the chances are that we could probably remove them at some point.</p>\n<p>With one of our earliest pilots, a customer wanted to use a terraform action. It failed and I felt a bit embarrassed by the reason. We were missing unzip in our images.</p>\n<p>The cure? Go and add unzip to the Dockerfile, and hit publish on our builder repository. In 3 minutes the problem was solved.</p>\n<p>But GitHub Actions is also incredibly versatile and it means even if something is missing, we don't necessary have to publish a new image for you to continue your work. Just add a step to your workflow to install the missing package.</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Add</span> <span class=\"hljs-string\">unzip</span>\n  <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">sudo</span> <span class=\"hljs-string\">apt-get</span> <span class=\"hljs-string\">install</span> <span class=\"hljs-string\">-qy</span> <span class=\"hljs-string\">unzip</span>\n</code></pre>\n<p>With every customer pilot we've done, there's tended to be one or two packages like this that they expected to see. For another customer it was \"libpq\". As a rule, if something is available in the hosted runner, we'll strongly consider adding it to ours.</p>\n<h2>Lesson 2 - It’s not GitHub, it can’t be GitHub. It was GitHub</h2>\n<p>Since actuated is a control-plane, a SaaS, a full-service - supported product, we are always asking first - is it us? Is it our code? Is it our infrastructure? Is it our network? Is it our hardware?</p>\n<p>If you open up the <a href=\"https://githubstatus.com\">GitHub status page</a>, you'll notice an outage almost every week - at times on consecutive days, or every few days on GitHub Actions or a service that affects them indirectly - like the package registry, Pages or Pull Requests.</p>\n<p><img src=\"/images/2023-03-lessons-learned/outage.png\" alt=\"Outage this week\"></p>\n<blockquote>\n<p>The second outage this week that unfortunately affected actuated customers.</p>\n</blockquote>\n<p>I'm not bashing on GitHub here, we're paying a high R&#x26;D cost to build on their platform. We want them to do well.</p>\n<p>But this is getting embarrassing. On a recent call, a customer told us: \"it's not your solution, it looks great for us, it's the reliability of GitHub, we're worried about adopting it\"</p>\n<p>What can you say to that? I can't tell them that their concerns are misplaced, because they're not.</p>\n<p>I reached out to Martin Woodward - Director of DevRel at GitHub. He told me that \"leadership are taking this very seriously. We're doing better than we were 12 months ago.\"</p>\n<p>GitHub is too big to fail. Let's hope they smooth out these bumps.</p>\n<h2>Lesson 3 - Webhooks can be unreliable</h2>\n<p>There's no good API to collect this historical data at the moment but we do have an open-source tool (<a href=\"https://github.com/self-actuated/actions-usage\">self-actuated/actions-usage</a>) we give to customers to get a summary of their builds before they start out with us.</p>\n<p>So we mirror a summary of job events from GitHub into our database, so that we can show customers trends in behaviour, and identify hot-spots on specific repos - long build times, or spikes in failure rates.</p>\n<p><img src=\"https://pbs.twimg.com/media/FqnJ8rLXgAEnJDZ?format=png&#x26;name=large\" alt=\"Insights chart\"></p>\n<blockquote>\n<p>Insights chart from the actuated dashboard</p>\n</blockquote>\n<p>We noticed that from time to time, jobs would show in our database as \"queued\" or \"in_progress\" and we couldn't work out why. A VM had been scheduled, the job had run, and completed.</p>\n<p>In some circumstances, GitHub forgot to send us an In Progress event, or they never sent us a queued event.</p>\n<p>Or they sent us queued, in progress, then completed, but in the reverse order.</p>\n<p>It took us longer than I'm comfortable with to track down this issue, but we've now adapted our API to handle these edge-cases.</p>\n<p>Some deeper digging showed that people have also had issues with Stripe webhooks coming out of order. We saw this issue only very recently, after handling 60k webhooks - so perhaps it was a change in the system being used at GitHub?</p>\n<h2>Lesson 4 - Autoscaling is hard and the API is sometimes wrong</h2>\n<p>We launch a VM on your servers for every time we receive a queued event. But we have no good way of saying that a particular VM can only run for a certain job.</p>\n<p>If there were five jobs queued up, then GitHub would send us five queued events, and we'd launch five VMs. But if the first job was cancelled, we'd still have all of those VMs running.</p>\n<p>Why? Why can't we delete the 5th?</p>\n<p>Because there is no determinism. It'd be a great improvement for user experience if we could tell GitHub's API - \"great, we see you queued build X, it must run on a runner with label Y\". But we can't do that today.</p>\n<p>So we developed a \"reaper\" - a background task that tracks launched VMs and can delete them after a period of inactivity. We did have an initial issue where GitHub was taking over a minute to send a job to a ready runner, which we fixed by increasing the idle timeout value. Right now it's working really well.</p>\n<p>There is still one remaining quirk where GitHub's API reports that an active runner where a job is running as idle. This happens surprisingly often - but it's not a big deal, the VM deletion call gets rejected by the GitHub API.</p>\n<h2>Lesson 5 - We can launch in under one second, but what about GitHub?</h2>\n<p>The way we have things tuned today, the delay from you hitting commit in GitHub, to the job executing is similar to that of hosted runners. But sometimes, GitHub lags a little - especially during an outage or when they're under heavy load.</p>\n<p><img src=\"/images/2023-03-lessons-learned/vms_running.png\" alt=\"VM launches\"></p>\n<blockquote>\n<p>Grafana Cloud showing a gauge of microVMs per managed host</p>\n</blockquote>\n<p>There could be a delay between when you commit, and when GitHub delivers the \"queued\" webhook.</p>\n<p>Scoring and placing a VM on your servers is very quick, then the boot time of the microVM is generally less than 1 second including starting up a dedicated Docker daemon inside the VM.</p>\n<p>Then the runner has to run a configuration script to register itself on the API</p>\n<p>Finally, the runner connects to a queue, and GitHub has to send it a payload to start the job.</p>\n<p>On those last two steps - we see a high success rate, but occasionally, GitHub's API will fail on either of those two operations. We receive an alert via Grafana Cloud and Discord - then investigate. In the worst case, we re-queue via our API the job and the new VM will pick up the pending job.</p>\n<p>Want to <a href=\"https://www.youtube.com/watch?v=2o28iUC-J1w\">watch a demo</a>?</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/2o28iUC-J1w\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<h2>Lesson 6 - Sometimes we need to debug a runner</h2>\n<p>When I announced actuated, I heard a lot of people asking for CircleCI's debug experience, <a href=\"https://docs.actuated.dev/tasks/debug-ssh/\">so I built something similar</a> and it's proved to be really useful for us in building actuated.</p>\n<p>Only yesterday, Ivan Subotic from Dasch Swiss messaged me and said:</p>\n<blockquote>\n<p>\"How cool!!! you don’t know how many hours I have lost on GitHub Actions without this.\"</p>\n</blockquote>\n<p>Recently there were two cases where we needed to debug a runner with an SSH shell.</p>\n<p>The first was for a machine on Hetzner, where the Docker Daemon was unable to pull images due to a DNS failure. I added steps to print out <code>/etc/resolv.conf</code> and that would be my first port of call. Debugging is great, but it's slow, if an extra step in the workflow can help us diagnose the problem, it's worth it.</p>\n<p>In the end, it took me about a day and a half to work out that Hetzner was blocking outgoing traffic on port 53 to Google and Cloudflare. What was worse - was that it was an intermittent problem.</p>\n<p>When we did other customer PoCs on Hetzner, we did not run into this issue. I even launched a \"cloud\" VM in the same region and performed a couple of <code>nslookup</code>s - they worked as expected for me.</p>\n<p>So I developed a <a href=\"https://github.com/self-actuated/hetzner-dns-action\">custom GitHub Action</a> to unblock the customer:</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">steps:</span>\n    <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">self-actuated/hetzner-dns-action@v1</span>\n</code></pre>\n<p>Was this environmental issue with Hetzner our responsibility? Arguably not, but our customers pay us to provide a \"like managed\" solution, and we are currently able to help them be successful.</p>\n<p>In the second case, Ivan needed to launch headless Chrome, and was using one of the many <code>setup-X</code> actions from the marketplace.</p>\n<p>I opened a debug session on one of our own runners, then worked backwards:</p>\n<pre><code class=\"hljs language-bash\">curl -sLS -O https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb\n\ndpkg -i ./google-chrome-stable_current_amd64.deb\n</code></pre>\n<p>This reported that some packages were missing, I got which packages by running <code>apt-get --fix-missing --no-recommends</code> and provided an example of how to add them.</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">jobs:</span>\n    <span class=\"hljs-attr\">chrome:</span>\n        <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">chrome</span>\n        <span class=\"hljs-attr\">runs-on:</span> <span class=\"hljs-string\">actuated</span>\n        <span class=\"hljs-attr\">steps:</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Add</span> <span class=\"hljs-string\">extra</span> <span class=\"hljs-string\">packages</span> <span class=\"hljs-string\">for</span> <span class=\"hljs-string\">Chrome</span>\n          <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n            sudo apt install -qyyy --no-install-recommends adwaita-icon-theme fontconfig fontconfig-config fonts-liberation gtk-update-icon-cache hicolor-icon-theme humanity-icon-theme libatk-bridge2.0-0 libatk1.0-0 libatk1.0-data libatspi2.0-0 ...\n</span>        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">browser-actions/setup-chrome@v1</span>\n        <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">chrome</span> <span class=\"hljs-string\">--version</span>\n</code></pre>\n<p>We could also add these to the base image by editing the Dockerfile that we maintain.</p>\n<h2>Lesson 7 - Docker Hub Rate Limits are a pain</h2>\n<p>Docker Hub rate limits are more of a pain on self-hosted runners than they are on GitHub's own runners.</p>\n<p>I ran into this problem whilst trying to rebuild around 20 OpenFaaS Pro repositories to upgrade a base image. So after a very short period of time, all code ground to a halt and every build failed.</p>\n<p>GitHub has a deal to pay Docker Inc so that you don't run into rate limits. At time of writing, you'll find a valid Docker Hub credential in the <code>$HOME/.docker/config.json</code> file on any hosted runner.</p>\n<p>Actuated customers would need to login at the top of every one of their builds that used Docker, and create an organisation-level secret with a pull token from the Docker Hub.</p>\n<p>We found a way to automate this, and speed up subsequent jobs by <a href=\"https://docs.actuated.dev/tasks/registry-mirror/\">caching images directly on the customer's server</a>.</p>\n<p>All they need to add to their builds is:</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">self-actuated/hub-mirror@master</span>\n</code></pre>\n<h2>Wrapping up</h2>\n<p>I hope that you've enjoyed hearing a bit about our journey so far. With every new pilot customer we learn something new, and improve the offering.</p>\n<p>Whilst there was a significant amount of very technical work at the beginning of actuated, most of our time now is spent on customer support, education, and improving the onboarding experience.</p>\n<p>If you'd like to know how actuated compares to hosted runners or managing the self-hosted runner on your own, we'd encourage <a href=\"https://actuated.dev/blog\">checking out the blog</a> and <a href=\"https://actuated.dev/faq\">FAQ</a>.</p>\n<p>Are your builds slowing the team down? Do you need better organisation-level insights and reporting? Or do you need Arm support? Are you frustrated with managing self-hosted runners?</p>\n<p><a href=\"https://docs.actuated.dev/register/#sign-up-for-the-pilot\">Reach out to us take part in the pilot</a></p>","title":"Lessons learned managing GitHub Actions and Firecracker","description":"Alex shares lessons from building a managed service for GitHub Actions with Firecracker.","author":"Alex Ellis","tags":["baremetal","githubactions","saas","lessons","github"],"author_img":"alex","image":"/images/2023-03-lessons-learned/background.jpg","date":"2023-03-31"}},"__N_SSG":true}