{"pageProps":{"post":{"slug":"actuated-com-two-year-review","fileName":"2024-08-06-actuated-com-two-year-review.md","contentHtml":"<p>Over two years ago we registered the actuated.dev domain with the intention to fix various issues with self-hosted CI runners for GitHub Actions using microVMs.</p>\n<p>It's been a long journey and microVMs are not for the feint of heart, and we've spent a significant amount of time building a scheduler, agent, Kernel, root-filesystem, dashboard and reporting to make it work well for CI workloads. microVMs remain a poorly documented and hard to use technology, so whilst basic things can be made <a href=\"/blog/actuated-for-gitlab\">to work in a short period of time</a>, the most important workings have to be understood only through trial &#x26; error and experience.</p>\n<p>I'll set out what we wanted to address in November 2022, the direction customer feedback has taken us, and what we're planning next.</p>\n<h2 id=\"what-we-set-out-to-address\">What we set out to address</h2>\n<p>Looking back, we've addressed <a href=\"/blog/blazing-fast-ci-with-microvms\">all the original concerns</a>, and covered new areas too:</p>\n<ul>\n<li>Every build job runs in an isolated microVM</li>\n</ul>\n<p>Why is this important? Unlike the standard self-hosted runner available from GitHub, an isolated microVM means that there can never be side effects left over between builds. One of the first problems we ran into with self-hosted runners prior to creating actuated, was side effects build up in surprising ways and causing flaky builds, and frustrating errors.</p>\n<ul>\n<li>Docker without the security concerns</li>\n</ul>\n<p>When a self-hosted runner executes inside a container, then makes use of Docker, it usually involves mounting a socket from the host, running as a privileged container, or running as root. In each case, it's trivial to escape the container and gain full administrative access to the host. So if you're running Actions Runtime Controller (ARC) or GitLab CI's Kubernetes operator and make use of Docker in any way, beware. Not only can a supply chain attack steal credentials, exfiltrate data &#x26; code, run cryptominers, but it can also escape the container and gain full control of the host and possibly the Kubernetes cluster and wider network.</p>\n<p>Some teams believe that having a \"separate Kubernetes cluster for CI\" solves these problems. It does not, it makes it harder to recognise when the CI system has been compromised, and since these will often run in the same cloud account, may make it possible to escalate privileges to the wider network.</p>\n<ul>\n<li>VMs without the boot-up time</li>\n</ul>\n<p>Actuated microVMs are finely tuned, so that even with a fully isolated Docker daemon running, the system is ready within 1s and connecting to GitHub's control-plane. If you've ever used an autoscaling group on AWS ECS, you're probably more used to a 3-5 minute boot-up for a new VM.</p>\n<ul>\n<li>Feels like managed, but is still self-hosted</li>\n</ul>\n<p>With actuated, we operate a managed control-plane, which means you don't have to think about GitHub Apps, bot accounts, rate-limits, what to do when GitHub has an outage. The control-plane receives notifications from your GitHub repositories, but has no access to the code or secrets. Only the GitHub runner software itself can checkout code and run jobs using GitHub's fine-grained security mechanisms, the same ones used for managed runners.</p>\n<p>So what do you have to manage? You'll need to rent or provision a server with KVM (nested, or hardware) and then follow our guide to install the actuated agent, or install our SSH key and we'll use an automated process to do it for you. After that, you can manage your runners and build-queue via the <a href=\"https://docs.actuated.com/dashboard/\">dashboard</a> and we'll monitor your servers via our central Grafana dashboard.</p>\n<ul>\n<li>Automated - Over The Air (OTA) updates</li>\n</ul>\n<p>Our own CI system builds both the actuated agent, and the root filesystem used for CI builds for GitHub Actions and GitLab CI on an automated basis. These are pushed out over the network to agents, so you never have to worry about updating the self-hosted runner, or the software within the VM image.</p>\n<p>See also: <a href=\"https://calyptia.com/blog/scaling-builds-with-actuated\">Scaling ARM builds with Actuated</a></p>\n<h2 id=\"predictable-flat-rate-pricing-with-new-burst-pricing\">Predictable flat-rate pricing, with new burst pricing</h2>\n<p>The <a href=\"/pricing\">pricing for actuated</a> was designed to be predictable and reasonable. If you run 100 builds or 1 million builds, you'll get charged the same amount, with concurrency being limited to whatever you decided fits your needs.</p>\n<p>For teams with a large amount of minutes, or larger runners than the \"standard\" tier of GitHub Actions, this can result in a 2-6x cost reduction.</p>\n<p>Even with flat-rate pricing, and a stable concurrency level of say 5 or 10 concurrent builds, there will be times where you need to cut a release, and want many jobs to run at once.</p>\n<p>For those times, we listened to your feedback and introduced burst pricing. You can opt-in to add extra concurrent builds to your account, which are only used if there are queued jobs for a set period of time.</p>\n<p>Pay only when needed: Let's say you hit your limit often, but are happy with some queueing. You can add an extra burst of 20 builds, but a queue time of 10 minutes. Then your extra concurrency will not get used until there have been jobs waiting for 10 minutes.</p>\n<p>Clear the queue as quickly as possible: You could have a base limit of 20 builds, but a burst of up to 100 builds. You'll only get charged for what you go over on a particular day, and only if you go over your base limit. If you stay within 20 concurrent builds, you'll pay nothing extra.</p>\n<p>See also: <a href=\"/blog/burst-billing-capacity\">Burst billing and capacity for GitHub Actions</a></p>\n<h2 id=\"server-pricing--white-glove-service\">Server pricing &#x26; white-glove service</h2>\n<p>Today, most of our customers use pay per minute bare-metal hosted by a cloud provider. But our first pilot customer was a mid-sized start-up who loved to run their own servers, maintain their own infrastructure. They bought Dell servers from eBay, packaged them with new hardware, then had a team of 5 engineers on standby to refurbish and manage them.</p>\n<p>Over time, we started to meet teams who wanted to outsource the server installation, maintenance, and monitoring to someone else. This makes actuated feel even more like managed runners, whilst keeping the benefits of self-hosted infrastructure. We're able to offer this as part of your subscription, because <a href=\"https://docs.actuated.com/install-agent/\">once we've run the installation of the agent</a>, there is rarely a reason to log into the host again. In the rare event of a catastrophic failure, we can have the server OS image flashed and the agent reinstalled within a few minutes.</p>\n<p>One of the downsides to using a technology like <a href=\"https://firecracker-microvm.github.io/\">Firecracker</a> is that it requires <a href=\"https://linux-kvm.org/page/Main_Page\">KVM</a> or nested virtualisation to be available on the server. If you're using AWS already, you'll be disappointed to learn that their bare-metal hardware is not only overpriced, but it isn't suited to CI workload which require a fast processor and storage.</p>\n<p><a href=\"https://docs.actuated.com/provision-server/\">We put together a list of servers that we recommend</a> and the rough costing for them, but to make it simple, you cannot beat Hetzner. Most of our customers rent bare-metal from them and we've been very pleased with the value for money and sheer performance.</p>\n<ul>\n<li>Docs: <a href=\"https://docs.actuated.com/provision-server/\">Provision a server</a></li>\n</ul>\n<h2 id=\"content--education\">Content &#x26; education</h2>\n<p>There are several unresolved problems with using self-hosted runners, not to mention the security issues. We've been working on a series of blog posts to help educate teams on how to get the most out of their self-hosted runners.</p>\n<ul>\n<li>Running a local cache to reduce latency <a href=\"/blog/local-caching-for-github-actions\">Testing the impact of a local cache for building Discourse</a></li>\n<li>Keeping costs down, and servers utilised with our metering tool <a href=\"/blog/right-sizing-vms-github-actions\">Right sizing VMs for GitHub Actions</a></li>\n<li>Safely launch VMs and different OSes - <a href=\"/blog/kvm-in-github-actions\">How to run KVM guests in your GitHub Actions</a></li>\n<li>GitHub pays Docker.com for unlimited Docker Hub pull keys, here's how to solve the problem for self-hosted runners: <a href=\"https://docs.actuated.com/tasks/registry-mirror/\">Set up a registry mirror</a></li>\n</ul>\n<p>Along with the <a href=\"/blog/right-sizing-vms-github-actions\">VM usage metering tool</a>, I mentioned earlier, which you can use on both managed and self-hosted runners, we created a free open source tool called <a href=\"https://github.com/self-actuated/actions-usage\">self-actuated/actions-usage</a>. You can use it to generate a report of your personal account's usage, or your organisation's usage over a period of time, you can even run it on a schedule as a GitHub Action. Customers have reports backed by a database, which can run queried on varying time periods and filter by repository, user, or organisation: <a href=\"https://docs.actuated.com/dashboard/\">actuated dashboard</a></p>\n<h2 id=\"artificial-intelligence-ai-machine-learning-ml-and-gpus\">Artificial Intelligence (AI), Machine Learning (ML) and GPUs</h2>\n<p>We started to see customer interest in AI and ML workloads for GitHub Actions and GitLab CI, but found that Firecracker could not support PCI devices such as GPUs. After spending time on R&#x26;D, we added support for <a href=\"https://github.com/cloud-hypervisor/cloud-hypervisor\">cloud-hypervisor</a> which has slightly different goals than Firecracker. Rather than focusing purely on serverless workloads, it adds support for PCI devices and is even able to run other Operating Systems than Linux.</p>\n<ul>\n<li><a href=\"https://actuated.com/blog/gpus-for-github-actions\">Accelerate GitHub Actions with dedicated GPUs</a></li>\n<li><a href=\"https://actuated.com/blog/ollama-in-github-actions\">Run AI models with ollama in CI with GitHub Actions</a></li>\n</ul>\n<h2 id=\"sponsored-ci-minutes-for-the-cncf\">Sponsored CI minutes for the CNCF</h2>\n<p>The <a href=\"https://actuated.com/blog/cncf-arm-march-update\">CNCF and Ampere Computing</a> joined together to sponsor CI minutes for top-tier open source projects such as containerd, runc, Open Telemetry, CRI-O, ArgoCD, Falco, eBPF and various others. In May this year we'd already run over 1.5 million CI minutes for these projects, and we're proud to be able to support the open source community in this way.</p>\n<ul>\n<li><a href=\"https://actuated.com/blog/millions-of-cncf-minutes\">On Running Millions of Arm CI Minutes for the CNCF</a></li>\n<li><a href=\"https://actuated.com/blog/is-the-self-hosted-runner-safe-github-actions\">Is the GitHub Actions self-hosted runner safe for Open Source?</a></li>\n</ul>\n<h2 id=\"whats-next\">What's next?</h2>\n<p>If you can relate to anything we've covered here on costs, performance, security, or something else, <a href=\"https://actuated.com/pricing\">please feel free to reach out to talk to us</a>. We can tell you in a short period of time whether actuated would be a good fit for your team, and what results other teams like yours may have seen already. Plans run month to month, so it's relatively low risk to try actuated out on a couple of repositories to see how you like it.</p>\n<p>Are you a GitLab CI user?</p>\n<p>We have just published new updates for actuated for self-hosted GitLab and are <a href=\"https://actuated.com/blog/actuated-for-gitlab\">looking for pilot customers</a>. Many of the same security and management issues exist whether you're using GitHub Actions or GitLab CI, so we're excited to bring the same level of security and performance to GitLab CI.</p>\n<p>Additional resources:</p>\n<ul>\n<li><a href=\"https://docs.actuated.com/faq/\">Actuated FAQ</a></li>\n<li><a href=\"https://docs.actuated.com/roadmap/\">Actuated roadmap</a></li>\n<li><a href=\"/blog/managing-github-actions\">Lessons learned managing GitHub Actions and Firecracker</a></li>\n</ul>","title":"We're now actuated.com","description":"We take a look back to our launch in November 2022, what we've learned since and what's next for actuated.com.","tags":["announcement","review","microvms"],"author_img":"alex","image":"/images/2024-08-dotcom/background.png","date":"2024-08-06"}},"__N_SSG":true}