{"pageProps":{"post":{"slug":"millions-of-cncf-minutes","fileName":"2024-05-30-millions-of-cncf-minutes.md","contentHtml":"<p>In this post I'll cover:</p>\n<ul>\n<li>Who's the program to bring actuated to the CNCF</li>\n<li>A new video interview with our team, the CNCF, Ampere and Equinix Metal</li>\n<li>What options teams had for Arm both and then after the program</li>\n<li>The high level numbers, and how that's split over the top 9 projects</li>\n<li>What's next for the program</li>\n</ul>\n<h3 id=\"whats-actuated\">What's Actuated?</h3>\n<blockquote>\n<p>Actuated is the only solution that gives a managed experience for self-hosted runners, on your own hardware through immutable microVMs.</p>\n</blockquote>\n<p>The immutability is key to both security and reliability. Each build is run in its own ephemeral and immutable microVM, meaning side effects cannot be left behind by prior builds. In addition, our team manages reliability for your servers and the integration with GitHub, for minimal disruption during GitHub outages.</p>\n<h2 id=\"why-did-the-cncf-want-actuated-for-its-projects\">Why did the CNCF want Actuated for its projects?</h2>\n<p>We've been working with <a href=\"https://amperecomputing.com/\">Ampere</a> and <a href=\"https://deploy.equinix.com/\">Equinix Metal</a> to provide CI via GitHub Actions for Cloud Native Computing (CNCF) projects. Ampere manufacture Arm-based CPUs with a focus on efficiency and high core density. Equinix Metal provide access to the Ampere Altra in their datacenters around the world.</p>\n<p>Last December, we met with <a href=\"https://www.linkedin.com/in/caniszczyk/\">Chris Aniszczyck</a> - CTO Linux Foundation/CNCF, <a href=\"https://www.linkedin.com/in/edwardvielmetti/\">Ed Vielmetti</a> - Open Source Manager Equinix, <a href=\"https://www.linkedin.com/in/dneary/\">Dave Neary</a> - Director of Developer Relations at Ampere and myself to discuss the program and what impact it was having so far.</p>\n<p>Watch the recap on YouTube: <a href=\"https://www.youtube.com/watch?v=sv3jtSvW9gk\">The Ampere Developer Impact: CNCF Pilot Discussion</a></p>\n<p>Past articles on the blog include:</p>\n<ul>\n<li>October 2023 launch - <a href=\"/blog/arm-ci-cncf-ampere\">Announcing managed Arm CI for CNCF projects</a></li>\n<li>March 2024 update - <a href=\"/blog/cncf-arm-march-update\">The state of Arm CI for the CNCF</a></li>\n</ul>\n<h2 id=\"before-and-after-the-program\">Before and after the program</h2>\n<p>Before we started the program, CNCF projects could be divided into three buckets:</p>\n<ol>\n<li>They were running Arm-based CI jobs on static servers that they managed</li>\n</ol>\n<p>In this case, etcd for instance had a team of half a dozen maintainers who were responsible for setting up, maintaining, and upgrading statically provisioned CI servers for the project. This was a significant overhead for the project maintainers, and the servers were often underutilized. The risk of side-effects being left behind between builds also posed a serious supply chain risk since etcd is consumed in virtually every Kubernetes deployment.</p>\n<ol start=\"2\">\n<li>They were running Arm-based CI using emulation (QEMU)</li>\n</ol>\n<p>QEMU can be combined with Docker's buildx for a quick and convenient way to build container images for x86 and Arm architectures. In the best case, it's a small change and may add a few minutes of extra overhead. In the worst case, we saw that jobs that ran in ~ 5 minutes, took over 6 hours to complete using QEMU and hosted runners. A prime example was fluentd, read their case-study here: <a href=\"https://calyptia.com/blog/scaling-builds-with-actuated\">Scaling ARM builds with Actuated</a></p>\n<ol start=\"3\">\n<li>They had no Arm CI at all</li>\n</ol>\n<p>In the third case, we saw projects like OpenTelemetry which had no support for Arm at all, but demand from their community to bring it up to on par with x86 builds. The need to self-manage insecure CI servers meant that Arm was a blocker for them.</p>\n<h3 id=\"after-the-program\">After the program</h3>\n<p>After the program was live, teams who had been maintaining their own servers got to remove lengthy documentation on server configuration and maintenance, and relied on our team to manage a pool of servers used for scheduling microVMs.</p>\n<p>As demand grew, we saw OpenTelemetry and etcd starve the shared pool of resources through very high usage patterns. This is a classic and known problem called \"Tragedy of the Commons\" - when a shared resource is overused by a subset of users, it can lead to a degradation of service for all users. To combat the problem, we added code to provision self-destructing servers for a period of 24-48 hours as need arose, and prevented the higher usage projects from running on at least on of the permanent servers through scheduling rules. One other issue we saw with OpenTelemetry in particular was that the various Go proxies that offer up Go modules appeared to be rejecting requests when too many jobs were running concurrently. As a workaround, we added a private Go proxy for them into the private network space where the CNCF servers run, this also massively reduced the bandwidth costs for the shared infrastructure.</p>\n<p><a href=\"https://calyptia.com/blog/scaling-builds-with-actuated\">Teams like fluent</a> moved from flakey builds that couldn't finish in 6 hours, to builds that finished in 5-10 minutes. This meant they could expand on their suite of tests.</p>\n<p>Where teams such as Cilium, Falco, or OpenTelemetry had no Arm CI support, we saw them quickly ramp up to running thousands of builds per month.</p>\n<p>Here's a quote from <a href=\"https://www.linkedin.com/in/fededp/\">Federico Di Pierro</a>, Senior Open Source Engineer @ Sysdig and maintainer of Falco:</p>\n<blockquote>\n<p>Falco really needed arm64 GitHub runners to elevate its support for the architecture and enlarge its userbase.\nActuated was the perfect solution for us because it was easy to leverage and relieved any burden for the maintainers. This way, we as maintainers, can focus on what really matters for the project, instead of fighting with maintaining and deploying self-hosted infrastructure.\nNow we are building, testing and releasing artifacts for arm64 leveraging Actuated for many of our projects, and it works flawlessly.\nSupport from Alex's team is always on point, and new kernel features are coming through super quickly!</p>\n</blockquote>\n<p><a href=\"https://github.com/akihirosuda\">Akihiro Suda</a>, Software Engineer at NTT Corp, and maintainer of several open source projects including: runc, containerd and lima had this to say:</p>\n<blockquote>\n<p>Huge thanks to Actuated for enabling us to run ARM64 tests without any mess.\nIt is very important for the runc project to run the tests on ARM64, as runc depends on several architecture-dependent components such as seccomp and criu.\nIt is also so nice that the Arm instance specification can be adjusted in a single line in the GitHub Actions workflow file.</p>\n</blockquote>\n<p><a href=\"https://github.com/fuweid\">Wei Fu</a>, a maintainer for containerd said:</p>\n<blockquote>\n<p>The containerd project was able to test each pull request for the Linux arm64 platform with the support of Actuated.\nIt's a significant step for containerd to mark the Linux arm64 platform as a top-tier supported platform, similar to amd64, since containerd has been widely used in the Arm world.</p>\n<p>Thanks to Actuated, we, the containerd community, were able to test container features (like mount-idmapping) on the new kernel without significant maintenance overhead for the test infrastructure.\nWith Actuated, we can focus on open-source deployment to cover more use case scenarios.</p>\n</blockquote>\n<p>Maintainers have direct access to discuss issues and improvements with us via a private Slack community. One of the things we've done in addition to adding burst capacity to the pool, was <a href=\"/blog/right-sizing-vms-github-actions\">to provide a tool to help teams right-size VMs for jobs</a> and to add support for <a href=\"/blog/custom-sizes-bpf-kvm\">eBPF technologies like BTF</a> in the Kernel.</p>\n<h3 id=\"numbers-at-a-glance\">Numbers at a glance</h3>\n<p>In our last update, 3 months ago, we'd run just under 400k build minutes for the CNCF. That number has now increased to 1.52M minutes, which is a ~ 300x increase in demand in a short period of time.</p>\n<p>Here's a breakdown of the top 9 projects by total minutes run, bearing in mind that this only includes jobs that ran to completion, there are thousands of minutes which ran, but were cancelled mid-way or by automation.</p>\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Organisation</th>\n<th>Total mins</th>\n<th>Total Jobs</th>\n<th>First job</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>open-telemetry</td>\n<td>593726</td>\n<td>40093</td>\n<td>2024-02-15</td>\n</tr>\n<tr>\n<td>2</td>\n<td>etcd-io</td>\n<td>372080</td>\n<td>21347</td>\n<td>2023-10-24</td>\n</tr>\n<tr>\n<td>3</td>\n<td>cri-o</td>\n<td>163927</td>\n<td>11131</td>\n<td>2023-11-27</td>\n</tr>\n<tr>\n<td>4</td>\n<td>falcosecurity</td>\n<td>138469</td>\n<td>13274</td>\n<td>2023-12-06</td>\n</tr>\n<tr>\n<td>5</td>\n<td>fluent</td>\n<td>89856</td>\n<td>10658</td>\n<td>2023-06-07</td>\n</tr>\n<tr>\n<td>6</td>\n<td>containerd</td>\n<td>87007</td>\n<td>11192</td>\n<td>2023-12-02</td>\n</tr>\n<tr>\n<td>7</td>\n<td>cilium</td>\n<td>73406</td>\n<td>6252</td>\n<td>2023-10-31</td>\n</tr>\n<tr>\n<td>8</td>\n<td>opencontainers</td>\n<td>3716</td>\n<td>458</td>\n<td>2023-12-15</td>\n</tr>\n<tr>\n<td>9</td>\n<td>argoproj</td>\n<td>187</td>\n<td>12</td>\n<td>2024-01-30</td>\n</tr>\n<tr>\n<td>(all)</td>\n<td>(Total)</td>\n<td>1520464</td>\n<td>116217</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<p>Most organisations build for several projects or repositories. In the case of etcd, the numbers also include the boltdb project, and for cilium, tetragon, and the Go bindings for ebpf are also included. Open Telemetry is mainly focused around the <a href=\"https://github.com/open-telemetry/opentelemetry-collector-contrib\">collectors and SDKs</a>.</p>\n<p>runc which is within the opencontainers organisation is technically an Open Container Initiative (OCI) project under the LinuxFoundation, rather than a CNCF project, but we gave them access since it is a key dependency for containerd and cri-o.</p>\n<h2 id=\"whats-next\">What's next?</h2>\n<p>With the exception of Argo, all of the projects are now relatively heavy users of the platform, with demand growing month on month, as you can see from the uptick from 389k minutes in March to a record high of 1.52 million minutes by the end of May of the same year. In the case of Argo, if you're a contributor or have done previous open source enablement, perhaps you could help them expand their Arm support via a series of <a href=\"https://github.com/argoproj/argo-cd/issues/9012\">Pull Requests to enable unit/e2e tests to run on Arm64</a>?</p>\n<p>We're continuing to improve the platform to support users during peak demand, outages on GitHub, and to provide a reliable way for CNCF projects to run their CI on real Arm hardware, at full speed.</p>\n<p>For instance, last month we just released a new 6.1 Kernel for the Ampere Altra, which means projects like Cilium and Falco can make use of new eBPF features introduced in recent Kernel versions, and will bring support for newer Kernels as the Firecracker team make them available. The runc and container teams also benefit from the newer Kernel and have been able to enable further tests for (Checkpoint/Restore In Userspace) CRIU and User namespaces for containerd.</p>\n<p>You can watch the interview I mentioned earlier with Chris, Ed, Dave and myself on YouTube:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sv3jtSvW9gk?si=2PVUFCx_QUt65v5-\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n<h3 id=\"we-could-help-you-too\">We could help you too</h3>\n<p>Actuated can manage x86 and Arm64 servers for GitHub Actions and <a href=\"/blog/secure-microvm-ci-gitlab\">self-managed GitLab CI</a>. If you'd like to speak to us about how we can speed up your jobs, reduce your maintenance efforts and lower your CI costs, <a href=\"https://actuated.com/pricing/\">reach out via this page</a>.</p>","title":"On Running Millions of Arm CI Minutes for the CNCF","description":"We've now run over 1.5 million minutes of CI time for various CNCF projects on Ampere hardware. Here's what we've learned.","tags":["cncf","enablement","arm"],"rollup":true,"author_img":"alex","image":"/images/2024-05-cncf-millions/background.png","date":"2024-05-30"}},"__N_SSG":true}