{"pageProps":{"post":{"id":"blazing-fast-ci-with-microvms","contentHtml":"<p>Around 6-8 months ago I started exploring MicroVMs out of curiosity. Around the same time, I saw an opportunity to <strong>fix</strong> self-hosted runners for GitHub Actions. <a href=\"https://docs.actuated.dev/\">Actuated</a> is now in pilot and aims to solve <a href=\"https://twitter.com/alexellisuk/status/1573599285362532353?s=20&#x26;t=dFcd54c4KIynk6vIGTb7QA\">most if not all of the friction</a>.</p>\n<p>There's three parts to this post:</p>\n<ol>\n<li>A quick debrief on Firecracker and MicroVMs vs legacy solutions</li>\n<li>Exploring friction with GitHub Actions from a hosted and self-hosted perspective</li>\n<li>Blazing fast CI with Actuated, and additional materials for learning more about Firecracker</li>\n</ol>\n<blockquote>\n<p>We're looking for customers who want to solve the problems explored in this post.\n<a href=\"https://docs.google.com/forms/d/e/1FAIpQLScA12IGyVFrZtSAp2Oj24OdaSMloqARSwoxx3AZbQbs0wpGww/viewform\">Register for the pilot</a></p>\n</blockquote>\n<h2>1) A quick debrief on Firecracker 🔥</h2>\n<blockquote>\n<p>Firecracker is an open source virtualization technology that is purpose-built for creating and managing secure, multi-tenant container and function-based services.</p>\n</blockquote>\n<p>I learned about <a href=\"https://github.com/firecracker-microvm/firecracker\">Firecracker</a> mostly by experimentation, building bigger and more useful prototypes. This helped me see what the experience was going to be like for users and the engineers working on a solution. I met others in the community and shared notes with them. Several people asked \"Are microVMs the next thing that will replace containers?\" I don't think they are, but they are an important tool where hard isolation is necessary.</p>\n<p>Over time, one thing became obvious:</p>\n<blockquote>\n<p>MicroVMs fill a need that legacy VMs and containers can't.</p>\n</blockquote>\n<p>If you'd like to know more about how Firecracker works and how it compares to traditional VMs and Docker, you can replay my deep dive session with Richard Case, Principal Engineer (previously Weaveworks, now at SUSE).</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/CYCsa5e2vqg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<blockquote>\n<p>Join Alex and Richard Case for a cracking time. The pair share what's got them so excited about Firecracker, the kinds of use-cases they see for microVMs, fundamentals of Linux Operating Systems and plenty of demos.</p>\n</blockquote>\n<h2>2) So what's wrong with GitHub Actions?</h2>\n<p>First let me say that I think GitHub Actions is a far better experience than Travis ever was, and we have moved all our CI for OpenFaaS, inlets and actuated to Actions for public and private repos. We've built up a good working knowledge in the community and the company.</p>\n<p>I'll split this part into two halves.</p>\n<h3>What's wrong with hosted runners?</h3>\n<p><strong>Hosted runners are constrained</strong></p>\n<p>Hosted runners are incredibly convenient, and for most of us, that's all we'll ever need, especially for public repositories with fast CI builds.</p>\n<p>Friction starts when the 7GB of RAM and 2 cores allocated causes issues for us - like when we're launching a KinD cluster, or trying to run E2E tests and need more power. Running out of disk space is also a common problem when using Docker images.</p>\n<p>GitHub recently launched new paid plans to get faster runners, however the costs add up, the more you use them.</p>\n<p>What if you could pay a flat fee, or bring your own hardware?</p>\n<p><strong>They cannot be used with public repos</strong></p>\n<p>From GitHub.com:</p>\n<blockquote>\n<p>We recommend that you only use self-hosted runners with private repositories. This is because forks of your public repository can potentially run dangerous code on your self-hosted runner machine by creating a pull request that executes the code in a workflow.</p>\n</blockquote>\n<blockquote>\n<p>This is not an issue with GitHub-hosted runners because each GitHub-hosted runner is always a clean isolated virtual machine, and it is destroyed at the end of the job execution.</p>\n</blockquote>\n<blockquote>\n<p>Untrusted workflows running on your self-hosted runner pose significant security risks for your machine and network environment, especially if your machine persists its environment between jobs.</p>\n</blockquote>\n<p>Read more about the risks: <a href=\"https://docs.github.com/en/actions/hosting-your-own-runners/about-self-hosted-runners\">Self-hosted runner security</a></p>\n<p>Despite a stern warning from GitHub, at least one notable CNCF project runs self-hosted ARM64 runners on public repositories.</p>\n<p>On one hand, I don't blame that team, they have no other option if they want to do open source, it means a public repo, which means risking everything knowingly.</p>\n<p>Is there another way we can help them?</p>\n<p>I spoke to the GitHub Actions engineering team, who told me that using an ephemeral VM and an immutable OS image would solve the concerns.</p>\n<p><strong>There's no access to ARM runners</strong></p>\n<p>Building with QEMU is incredibly slow as Frederic Branczyk, Co-founder, Polar Signals found out when his Parca project was taking 33m5s to build.</p>\n<p>I forked it and changed a line: <code>runs-on: actuated-aarch64</code> and reduced the total build time to 1m26s.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This morning <a href=\"https://twitter.com/fredbrancz?ref_src=twsrc%5Etfw\">@fredbrancz</a> said that his ARM64 build was taking 33 minutes using QEMU in a GitHub Action and a hosted runner.<br><br>I ran it on <a href=\"https://twitter.com/selfactuated?ref_src=twsrc%5Etfw\">@selfactuated</a> using an ARM64 machine and a microVM.<br><br>That took the time down to 1m 26s!! About a 22x speed increase. <a href=\"https://t.co/zwF3j08vEV\">https://t.co/zwF3j08vEV</a> <a href=\"https://t.co/ps21An7B9B\">pic.twitter.com/ps21An7B9B</a></p>&mdash; Alex Ellis (@alexellisuk) <a href=\"https://twitter.com/alexellisuk/status/1583089248084729856?ref_src=twsrc%5Etfw\">October 20, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong>They limit maximum concurrency</strong></p>\n<p>On the free plan, you can only launch 20 hosted runners at once, this increases as you pay GitHub more money.</p>\n<p><strong>Builds on private repos are billed per minute</strong></p>\n<p>I think this is a fair arrangement. GitHub donates Azure VMs to open source users or any public repo for that matter, and if you want to build closed-source software, you can do so by renting VMs per hour.</p>\n<p>There's a free allowance for free users, then Pro users like myself get a few more build minutes included. However, These are on the standard, 2 Core 7GB RAM machines.</p>\n<p>What if you didn't have to pay per minute of build time?</p>\n<h3>What's wrong with self-hosted runners?</h3>\n<p><strong>It's challenging to get all the packages right as per a hosted runner</strong></p>\n<p>I spent several days running and re-running builds to get all the software required on a self-hosted runner for the private repos for <a href=\"https://www.openfaas.com/pricing/\">OpenFaaS Pro</a>. Guess what?</p>\n<p>I didn't want to touch that machine again afterwards, and even if I built up a list of apt packages, it'd be wrong in a few weeks. I then had a long period of tweaking the odd missing package and generating random container image names to prevent Docker and KinD from conflicting and causing side-effects.</p>\n<p>What if we could get an image that had everything we needed and was always up to date, and we didn't have to maintain that?</p>\n<p><strong>Self-hosted runners cause weird bugs due to caching</strong></p>\n<p>If your job installs software like apt packages, the first run will be different from the second. The system is mutable, rather than immutable and the first problem I faced was things clashing like container names or KinD cluster names.</p>\n<p><strong>You get limited to one job per machine at a time</strong></p>\n<p>The default setup is for a self-hosted Actions Runner to only run one job at a time to avoid the issues I mentioned above.</p>\n<p>What if you could schedule as many builds as made sense for the amount of RAM and core the host has?</p>\n<p><strong>Docker isn't isolated at all</strong></p>\n<p>If you install Docker, then the runner can take over that machine since Docker runs at root on the host. If you try user-namespaces, many things break in weird and frustrating aways like Kubernetes.</p>\n<p>Container images and caches can cause conflicts between builds.</p>\n<p><strong>Kubernetes isn't a safe alternative</strong></p>\n<p>Adding a single large machine isn't a good option because of the dirty cache, weird stateful errors you can run into, and side-effects left over on the host.</p>\n<p>So what do teams do?</p>\n<p>They turn to a controller called <a href=\"https://github.com/actions/actions-runner-controller\">Actions Runtime Controller (ARC)</a>.</p>\n<p>ARC is non trivial to set up and requires you to create a GitHub App or PAT (please don't do that), then to provision, monitor, maintain and upgrade a bunch of infrastructure.</p>\n<p>This controller starts a number of re-usable (not one-shot) Pods and has them register as a runner for your jobs. Unfortunately, they still need to use Docker or need to run Kubernetes which leads us to two awful options:</p>\n<ol>\n<li>Sharing a Docker Socket (easy to become root on the host)</li>\n<li>Running Docker In Docker (requires a privileged container, root on the host)</li>\n</ol>\n<p>There is a third option which is to use a non-root container, but that means you can't use <code>sudo</code> in your builds. You've now crippled your CI.</p>\n<p>What if you don't need to use Docker build/run, Kaniko or Kubernetes in CI at all? Well ARC may be a good solution for you, until the day you do need to ship a container image.</p>\n<h2>3) Can we fix it? Yes we can.</h2>\n<p><a href=\"https://docs.actuated.dev/\">Actuated</a> (\"cause (a machine or device) to operate.\") is a semi-managed solution that we're building at OpenFaaS Ltd.</p>\n<p><img src=\"https://docs.actuated.dev/images/conceptual-high-level.png\" alt=\"A semi-managed solution, where you provide hosts and we do the rest.\"></p>\n<blockquote>\n<p>A semi-managed solution, where you provide hosts and we do the rest.</p>\n</blockquote>\n<p>You provide your own hosts to run jobs, we schedule to them and maintain a VM image with everything you need.</p>\n<p>You install our GitHub App, then change <code>runs-on: ubuntu-latest</code> to <code>runs-on: actuated</code> or <code>runs-on: actuated-aarch64</code> for ARM.</p>\n<p>Then, provision one or more VMs with nested virtualisation enabled on GCP, DigitalOcean or Azure, or a bare-metal host, and <a href=\"https://docs.actuated.dev/add-agent/\">install our agent</a>. That's it.</p>\n<p>If you need ARM support for your project, the <a href=\"https://aws.amazon.com/ec2/instance-types/a1/\">a1.metal from AWS</a> is ideal with 16 cores and 32GB RAM, or an <a href=\"https://amperecomputing.com/processors/ampere-altra/\">Ampere Altra</a> machine like the c3.large.arm64 from <a href=\"https://metal.equinix.com/product/servers/c3-large-arm64/\">Equinix Metal</a> with 80 Cores and 256GB RAM if you really need to push things. The 2020 M1 Mac Mini also works well with <a href=\"https://asahilinux.org/\">Asahi Linux</a>, and can be maxed out at 16GB RAM / 8 Cores. <a href=\"https://twitter.com/alexellisuk/status/1585228202087415808?s=20&#x26;t=kW-cfn44pQTzUsRiMw32kQ\">I even tried Frederic's Parca job on my Raspberry Pi</a> and it was 26m30s quicker than a hosted runner!</p>\n<p>Whenever a build is triggered by a repo in your organisation, the control plane will schedule a microVM on one of your own servers, then GitHub takes over from there. When the GitHub runner exits, we forcibly delete the VM.</p>\n<p>You get:</p>\n<ul>\n<li>A fresh, isolated VM for every build, no re-use at all</li>\n<li>A fast boot time of ~ &#x3C;1-2s</li>\n<li>An immutable image, which is updated regularly and built with automation</li>\n<li>Docker preinstalled and running at boot-up</li>\n<li>Efficient scheduling and packing of builds to your fleet of hosts</li>\n</ul>\n<p>It's capable of running Docker and Kubernetes (KinD, kubeadm, K3s) with full isolation. You'll find some <a href=\"https://docs.actuated.dev/\">examples in the docs</a>, but anything that works on a hosted runner we expect to work with actuated also.</p>\n<p>Here's what it looks like:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/2o28iUC-J1w\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Want the deeply technical information and comparisons? <a href=\"https://docs.actuated.dev/faq/\">Check out the FAQ</a></p>\n<p>You may also be interested in a debug experience that we're building for GitHub Actions. It can be used to launch a shell session over SSH with hosted and self-hosted runners: <a href=\"https://www.youtube.com/watch?v=l9VuQZ4a5pc\">Debug GitHub Actions with SSH and launch a cloud shell</a></p>\n<h2>Wrapping up</h2>\n<p>We're piloting actuated with customers today. If you're interested in faster, more isolated CI without compromising on security, we would like to hear from you.</p>\n<p><strong>Register for the pilot</strong></p>\n<p>We're looking for customers to participate in our pilot.</p>\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLScA12IGyVFrZtSAp2Oj24OdaSMloqARSwoxx3AZbQbs0wpGww/viewform\">Register for the pilot 📝</a></p>\n<p>Actuated is live in pilot and we've already run thousands of VMs for our customers, but we're only just getting started here.</p>\n<p><img src=\"https://blog.alexellis.io/content/images/2022/11/vm-launch.png\" alt=\"VM launch events over the past several days\"></p>\n<blockquote>\n<p>Pictured: VM launch events over the past several days</p>\n</blockquote>\n<p>Other links:</p>\n<ul>\n<li><a href=\"https://docs.actuated.dev/faq/\">Read the FAQ</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=2o28iUC-J1w\">Watch a short video demo</a></li>\n<li><a href=\"https://twitter.com/selfactuated\">Follow actuated on Twitter</a></li>\n</ul>\n<p><strong>What about GitLab?</strong></p>\n<p>We're focusing on GitHub Actions users for the pilot, but have a prototype for GitLab. If you'd like to know more, reach out using the <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScA12IGyVFrZtSAp2Oj24OdaSMloqARSwoxx3AZbQbs0wpGww/viewform\">Apply for the pilot form</a>.</p>\n<p><strong>Just want to play with Firecracker or learn more about microVMs vs legacy VMs and containers?</strong></p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=CYCsa5e2vqg\">Watch A cracking time: Exploring Firecracker &#x26; MicroVMs</a></li>\n<li><a href=\"https://github.com/alexellis/firecracker-init-lab\">Try my firecracker lab on GitHub - alexellis/firecracker-init-lab</a></li>\n</ul>\n<h2>What are people saying about actuated?</h2>\n<blockquote>\n<p>\"We've been piloting Actuated recently. It only took 30s create 5x isolated VMs, run the jobs and tear them down again inside our on-prem environment (no Docker socket mounting shenanigans)! Pretty impressive stuff.\"</p>\n<p>Addison van den Hoeven - DevOps Lead, Riskfuel</p>\n</blockquote>\n<blockquote>\n<p>\"Actuated looks super cool, interested to see where you take it!\"</p>\n<p>Guillermo Rauch, CEO Vercel</p>\n</blockquote>\n<blockquote>\n<p>\"This is great, perfect for jobs that take forever on normal GitHub runners. I love what Alex is doing here.\"</p>\n<p>Richard Case, Principal Engineer, SUSE</p>\n</blockquote>\n<blockquote>\n<p>\"Thank you. I think actuated is amazing.\"</p>\n<p>Alan Sill, NSF Cloud and Autonomic Computing (CAC) Industry-University Cooperative Research Center</p>\n</blockquote>\n<blockquote>\n<p>\"Nice work, security aspects alone with shared/stale envs on self-hosted runners.\"</p>\n<p>Matt Johnson, Palo Alto Networks</p>\n</blockquote>\n<blockquote>\n<p>\"Is there a way to pay github for runners that suck less?\"</p>\n<p>Darren Shepherd, Acorn Labs</p>\n</blockquote>\n<blockquote>\n<p>\"Excited to try out actuated! We use custom actions runners and I think there's something here 🔥\"</p>\n<p>Nick Gerace, System Initiative</p>\n</blockquote>\n<blockquote>\n<p>It is awesome to see the work of Alex Ellis with Firecracker VMs. They are provisioning and running Github Actions in isolated VMs in seconds (vs minutes).\"</p>\n<p>Rinat Abdullin, ML &#x26; Innovation at Trustbit</p>\n</blockquote>\n<blockquote>\n<p>This is awesome!\" (After reducing Parca build time from 33.5 minutes to 1 minute 26s)</p>\n<p>Frederic Branczyk, Co-founder, Polar Signals</p>\n</blockquote>","title":"Blazing fast CI with MicroVMs","description":"I saw an opportunity to fix self-hosted runners for GitHub Actions. Actuated is now in pilot and aims to solve most if not all of the friction.","author":"Alex Ellis","tags":["cicd","bare-metal","kubernetes","DevOps","linux","firecracker"],"author_img":"alex","image":"/images/2022-11-10-blazing-fast-ci-with-microvms/actuated-pilot.png","canonical":"https://blog.alexellis.io/blazing-fast-ci-with-microvms/","date":"2022-11-10"}},"__N_SSG":true}