{"pageProps":{"post":{"slug":"custom-sizes-bpf-kvm","fileName":"2023-12-04-custom-sizes-bpf-kvm.md","contentHtml":"<p>In this December update, we've got three new updates to the platform that we think you'll benefit from. From requesting custom vCPU and RAM per job, to eBPF features, to spreading your plan across multiple machines dynamically, it's all new and makes actuated better value.</p>\n<h2>New eBPF support and 5.10.201 Kernel</h2>\n<p>And as part of our work to provide hosted <a href=\"/blog/arm-ci-cncf-ampere\">Arm CI for CNCF projects</a>, including <a href=\"https://github.com/cilium/tetragon\">Tetragon</a> and <a href=\"https://github.com/cilium/cilium\">Cilium</a>, we've now enabled eBPF and BTF features within the Kernel.</p>\n<blockquote>\n<p><a href=\"https://en.wikipedia.org/wiki/Berkeley_Packet_Filter\">Berkley Packet Filter (BPF)</a> is an advanced way to integrate with with the Kernel, for observability, security and networking. You'll see it included in various CNCF projects like Cilium, <a href=\"https://github.com/falcosecurity/falco\">Falco</a>, <a href=\"https://www.cncf.io/projects/kepler/\">Kepler</a>, and others.</p>\n</blockquote>\n<p>Whilst BPF is powerful, it's also a very fast moving space, and was particularly complicated to patch to Firecracker's minimal Kernel configuration. We want to say a thank you to <a href=\"https://twitter.com/mtardy_?lang=en\">Mahé Tardy\n</a> who maintains Tetragon and to <a href=\"https://www.linkedin.com/in/mauilion\">Duffie Coolie</a> both from <a href=\"https://isovalent.com/\">Isovalent</a> for pointers and collaboration.</p>\n<p>We've made a big jump in the supported Kernel version from 5.10.77 up to 5.10.201, with newer revisions being made available on a continual basis.</p>\n<p>To update your servers, log in via SSH and edit <code>/etc/default/actuated</code>.</p>\n<p>For amd64:</p>\n<pre><code>IMAGE_REF=\"ghcr.io/openfaasltd/actuated-ubuntu22.04:x86_64-latest\"\nKERNEL_REF=\"ghcr.io/openfaasltd/actuated-kernel:x86_64-latest\"\n</code></pre>\n<p>For arm64:</p>\n<pre><code>IMAGE_REF=\"ghcr.io/openfaasltd/actuated-ubuntu22.04:aarch64-latest\"\nKERNEL_REF=\"ghcr.io/openfaasltd/actuated-kernel:aarch64-latest\"\n</code></pre>\n<p>Once you have the new images in place, reboot the server. Updates to the Kernel and root filesystem will be delivered Over The Air (OTA) automatically by our team.</p>\n<h2>Request custom vCPU and RAM per job</h2>\n<p>Our initial version of actuated aimed to set a specific vCPU and RAM value for each build, designed to slice up a machine equally for the best mix of performance and concurrency. We would recommend it to teams during their onboarding call, then mostly leave it as it was. For a machine with 128GB RAM and 32 threads, you may have set it up for 8 jobs with 4x vCPU and 16GB RAM each, or 4 jobs with 8x vCPU and 32GB RAM.</p>\n<p>However, whilst working with Justin Gray, CTO at Toolpath, we found that their build needed increasing amounts of RAM to avoid an Out Of Memory (OOM) crash, and so implemented custom labels.</p>\n<p>These labels do not have any predetermined values, so you can change them to any value you like, independently. You're not locked into a set combinations.</p>\n<p>Small tasks, automation, publishing Helm charts?</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">runs-on:</span> <span class=\"hljs-string\">actuated-2cpu-8gb</span>\n</code></pre>\n<p>Building a large application, or training an AI model?</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">runs-on:</span> <span class=\"hljs-string\">actuated-32cpu-128gb</span>\n</code></pre>\n<h2>Spreading your plan across all available hosts</h2>\n<p>Previously, if you had a plan with 10 concurrent builds and both an Arm server and an amd64 server, we'd split your plan statically 50/50. So you could run a maximum of 5 Arm and 5 amd64 builds at the same time.</p>\n<p>Now, we've made this dynamic, all of your 10 builds can start on the Arm or amd64 server. Or, 1 could start on the Arm server, then 9 on the amd64 server, and so on.</p>\n<p>The change makes the product better value for money, and we had always wanted it to work this way.</p>\n<p>Thanks to <a href=\"https://uk.linkedin.com/in/patrickjkstephens\">Patrick Stephens at Fluent/Calyptia</a> for the suggestion and for helping us test it out.</p>\n<h2>KVM acceleration aka running VMs in your CI pipeline</h2>\n<p>When we started actuated over 12 months ago, there was no support for using KVM acceleration, or running a VM within a GitHub Actions job within GitHub's infrastructure. We made it available for our customers first, with a custom Kernel configuration for <em>x86_64</em> servers. Arm support for launching VMs within VMs is not currently available in the current generation of Ampere servers, but may be available within the next generation of chips and Kernels.</p>\n<p>We have several tutorials including how to run Firecracker itself within a CI job, Packer, nix and more.</p>\n<p>When you run Packer in a VM, instead of with one of the cloud drivers, you save on time and costs, by not having to fire up cloud resources on AWS, GCP, Azure, and so forth. Instead, you can run a local VM to build the image, then convert it to an AMI or another format.</p>\n<p>One of our customers has started exploring launching a VM during a CI job in order to test air-gapped support for enterprise customers. This is a great example of how you can use nested virtualisation to test your own product in a repeatable way.</p>\n<p>Nix benefits particularly from being able to create a clean, isolated environment within a CI pipeline, to get a repeatable build. <a href=\"https://twitter.com/grhmc\">Graham Christensen</a> from <a href=\"https://github.com/determinateSystems/nix-installer-action\">Determinate Systems reached out to collaborate on testing their Nix installer</a> in actuated.</p>\n<p>He didn't expect it to run, but when it worked first time, he remarked: \"Perfect! I'm impressed and happy that our action works out of the box.\"</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">jobs:</span>\n  <span class=\"hljs-attr\">specs:</span>\n    <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">ci</span>\n    <span class=\"hljs-attr\">runs-on:</span> [<span class=\"hljs-string\">actuated-16cpu-32gb</span>]\n    <span class=\"hljs-attr\">steps:</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">DeterminateSystems/nix-installer-action@main</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n            nix-build '&#x3C;nixpkgs/nixos/tests/doas.nix>'\n</span></code></pre>\n<ul>\n<li><a href=\"https://actuated.dev/blog/kvm-in-github-actions\">How to run KVM guests in your GitHub Actions</a></li>\n<li><a href=\"https://actuated.dev/blog/automate-packer-qemu-image-builds\">Automate Packer Images with QEMU and Actuated</a></li>\n<li><a href=\"https://actuated.dev/blog/faster-nix-builds\">Faster Nix builds with GitHub Actions and actuated</a></li>\n<li><a href=\"https://docs.actuated.dev/examples/kvm-guest\">Docs: Run a KVM guest</a></li>\n</ul>\n<h2>Wrapping up</h2>\n<p>We've now released eBPF/BTF support as part of onboarding CNCF projects, updated to the latest Kernel revision, made scheduling better value for money &#x26; easier to customise, and have added a range of tutorials for getting the most out of nested virtualisation.</p>\n<p>If you'd like to try out actuated, you can get started same day.</p>\n<p><a href=\"/pricing\">Talk to us.</a>.</p>\n<p>You may also like:</p>\n<ul>\n<li><a href=\"/blog/arm-ci-cncf-ampere\">Announcing managed Arm CI for CNCF projects</a></li>\n<li><a href=\"https://docs.actuated.dev/\">Actuated docs &#x26; FAQ</a></li>\n</ul>","title":"December Boost: Custom Job Sizes, eBPF Support & KVM Acceleration","description":"You can now request custom amounts of RAM and vCPU for jobs, run eBPF within jobs, and use KVM acceleration.","tags":["ebpf","cloudnative","opensource"],"author_img":"alex","image":"/images/2023-12-scheduling-bpf/background-bpf.png","date":"2023-12-04"}},"__N_SSG":true}