{"pageProps":{"post":{"slug":"faster-nix-builds","fileName":"2023-06-12-faster-nix-builds.md","contentHtml":"<p><a href=\"https://github.com/openfaas/faasd\">faasd</a> is a lightweight and portable version of <a href=\"https://www.openfaas.com/\">OpenFaaS</a> that was created to run on a single host. In my spare time I maintain <a href=\"https://github.com/welteki/faasd-nix\">faasd-nix</a>, a project that packages faasd and exposes a NixOS module so it can be run with NixOS.</p>\n<p>The module itself depends on faasd, containerd and the CNI plugins and all of these binaries are built in CI with Nix and then cached using <a href=\"https://www.cachix.org/\">Cachix</a> to save time on subsequent builds.</p>\n<p>I often deploy faasd with NixOS on a Raspberry Pi and to the cloud, so I build binaries for both <code>x86_64</code> and <code>aarch64</code>. The build usually runs on the default GitHub hosted action runners. Now because GitHub currently doesn't have Arm support, I use QEMU instead which can emulate them. The drawback of this approach is that builds can sometimes be several times slower.</p>\n<blockquote>\n<p>For some of our customers, their builds couldn't even complete in 6 hours using QEMU, and only took between 5-20 minutes using native Arm hardware. Alex Ellis, Founder of Actuated.</p>\n</blockquote>\n<p>While upgrading to the latest nixpkgs release recently I decided to try and build the project on runners managed with Actuated to see the improvements that can be made by switching to both bigger <code>x86_64</code> iron and native Arm hardware.</p>\n<h2 id=\"nix-and-github-actions\">Nix and GitHub actions</h2>\n<p>One of the features Nix offers are reproducible builds. Once a package is declared it can be built on any system. There is no need to prepare your machine with all the build dependencies. The only requirement is that Nix is installed.</p>\n<blockquote>\n<p>If you are new to Nix, then I'd recommend you read the <a href=\"https://zero-to-nix.com/start/install\">Zero to Nix</a> guide. It's what got me excited about the project.</p>\n</blockquote>\n<p>Because Nix is declarative and offers reproducible builds, it is easy to setup a concise build pipeline for GitHub actions. A lot of steps usually required to setup the build environment can be left out. For instance, faasd requires Go, but there's no need to install it onto the build machine, and you'd normally have to install btrfs-progs to build containerd, but that's not something you have to think about, because Nix will take care of it for you.</p>\n<p>Another advantage of the reproducible builds is that if it works on your local machine it most likely also works in CI. No need to debug and find any discrepancies between your local and CI environment.</p>\n<blockquote>\n<p>Of course, if you ever do get frustrated and want to debug a build, you can use the built-in <a href=\"https://docs.actuated.dev/tasks/debug-ssh/\">SSH feature in Actuated</a>. Alex Ellis, Founder of Actuated.</p>\n</blockquote>\n<p>This is what the workflow looks like for building faasd and its related packages:</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">jobs:</span>\n  <span class=\"hljs-attr\">build:</span>\n    <span class=\"hljs-attr\">runs-on:</span> <span class=\"hljs-string\">ubuntu-latest</span>\n    <span class=\"hljs-attr\">steps:</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">actions/checkout@v3</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">cachix/install-nix-action@v21</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">faasd</span> <span class=\"hljs-string\">🔧</span>\n        <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n          nix build -L .#faasd\n</span>      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">containerd</span> <span class=\"hljs-string\">🔧</span>\n        <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n          nix build -L .#faasd-containerd\n</span>      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">cni-plugin</span> <span class=\"hljs-string\">🔧</span>\n        <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n          nix build -L .#faasd-cni-plugins\n</span></code></pre>\n<p>All this pipeline does is install Nix, using the <a href=\"https://github.com/marketplace/actions/install-nix\">cachix/install-nix-action</a> and run the <code>nix build</code> command for the packages that need to be built.</p>\n<h2 id=\"notes-on-the-nix-build-for-aarch64\">Notes on the nix build for aarch64</h2>\n<p>To build the packages for multiple architectures there are a couple of options:</p>\n<ul>\n<li>cross-compiling, Nix has great support for cross compilation.</li>\n<li>compiling through binfmt QEMU.</li>\n<li>compiling natively on an aarch64 machine.</li>\n</ul>\n<p>The preferred option would be to compile everything natively on an aarch64 machine as that would result in the best performance. However, at the time of writing GitHub does not provide Arm runners. That is why QEMU is used by many people to compile binaries in CI.</p>\n<p>Enabling the binfmt wrapper on NixOS can be done easily through the NixOS configuration. On non-NixOS machines, like on the GitHub runner VM, the QEMU static binaries need to be installed and the Nix daemon configuration updated.</p>\n<p>Instructions to configure Nix for compilation with QEMU can be found on the <a href=\"https://nixos.wiki/wiki/NixOS_on_ARM#Compiling_through_binfmt_QEMU\">NixOS wiki</a></p>\n<p>The workflow for building aarch64 packages with QEMU on GitHub Actions looks like this:</p>\n<pre><code class=\"hljs language-yaml\"><span class=\"hljs-attr\">jobs:</span>\n  <span class=\"hljs-attr\">build:</span>\n    <span class=\"hljs-attr\">runs-on:</span> <span class=\"hljs-string\">ubuntu-latest</span>\n    <span class=\"hljs-attr\">steps:</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">actions/checkout@v3</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">docker/setup-qemu-action@v2</span>\n      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">uses:</span> <span class=\"hljs-string\">cachix/install-nix-action@v21</span>\n        <span class=\"hljs-attr\">with:</span>\n          <span class=\"hljs-attr\">extra_nix_config:</span> <span class=\"hljs-string\">|\n            extra-platforms = aarch64-linux\n</span>      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">faasd</span> <span class=\"hljs-string\">🔧</span>\n        <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n          nix build -L .#packages.aarch64-linux.faasd\n</span>      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">containerd</span> <span class=\"hljs-string\">🔧</span>\n        <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n          nix build -L .#packages.aarch64-linux.faasd-containerd\n</span>      <span class=\"hljs-bullet\">-</span> <span class=\"hljs-attr\">name:</span> <span class=\"hljs-string\">Build</span> <span class=\"hljs-string\">cni-plugin</span> <span class=\"hljs-string\">🔧</span>\n        <span class=\"hljs-attr\">run:</span> <span class=\"hljs-string\">|\n          nix build -L .#packages.aarch64-linux.faasd-cni-plugins\n</span>\n</code></pre>\n<p>Install the QEMU static binaries using <a href=\"https://github.com/docker/setup-qemu-action\">docker/setup-qemu-action</a>. Let the nix daemon know that it can build for aarch64 by adding <code>extra-platforms = aarch64-linux</code> via the <code>extra_nix_config</code> input on the install nix action. Update the nix build commands to specify platform e.g. <code>nix build .#packages.aarch64-linux.faasd</code>.</p>\n<h2 id=\"speeding-up-the-build-with-a-raspberry-pi\">Speeding up the build with a Raspberry Pi</h2>\n<p>Nix has great support for caching and build speeds can be improved greatly by never building things twice. This project normally uses <a href=\"https://www.cachix.org/\">Cachix</a> for caching and charing binaries across systems. For this comparison caching was disabled. All packages and their dependencies are built from scratch again each time.</p>\n<p>Building the project takes around 4 minutes and 20 seconds on the standard GitHub hosted runner. After switching to a more powerful Actuated runner with 4CPUs and 8GB of RAM the build time dropped to 2 minutes and 15 seconds.</p>\n<p><img src=\"/images/2023-06-faster-nix-builds/amd64-build-comparison.png\" alt=\"Comparison of more powerful Actuated runner with GitHub hosted runner\"></p>\n<blockquote>\n<p>Comparison of more powerful Actuated runner with GitHub hosted runner.</p>\n</blockquote>\n<p>While build times are still acceptable for x86_64 this is not the case for the aarch64 build. It takes around 55 minutes to complete the Arm build with QEMU on a GitHub runner.</p>\n<p>Running the same build with QEMU on the Actuated runner already brings down the build time to 19 minutes and 40 seconds. Running the build natively on a Raspberry Pi 4 (8GB) completed in 11 minutes and 47 seconds. Building on a more powerful Arm machine would potentially reduce this time to a couple of minutes.</p>\n<p><img src=\"/images/2023-06-faster-nix-builds/arm64-build-comparison.png\" alt=\"Results of the matrix build comparing the GitHub hosted runner and the 2 Actuated runners\"></p>\n<blockquote>\n<p>Results of the matrix build comparing the GitHub hosted runner and the 2 Actuated runners.</p>\n</blockquote>\n<p>Running the build natively on the Pi did even beat the fast bare-metal machine that is using QEMU.</p>\n<p>My colleague Alex ran the same build on his Raspberry Pi using Actuated and an NVMe mounted over USB-C, he got the build time down even further. Why? Because it increased the I/O performance. In fact, if you build this on server-grade Arm like the Ampere Altra, it would be about 4x faster than the Pi 4.</p>\n<p>Building for Arm:</p>\n<ul>\n<li>Alex's Raspberry Pi with NVMe: 10m49s</li>\n<li>An Ampere Altra on Equinix Metal: 3m29s</li>\n</ul>\n<p>Building for x86_64</p>\n<ul>\n<li>AMD Epyc on Equinix Metal: 1m57s</li>\n</ul>\n<p><img src=\"/images/2023-06-faster-nix-builds/alex-results.png\" alt=\"Alex&#x27;s results\"></p>\n<p>These results show that whatever the Arm hardware you pick, it'll likely be faster than QEMU, even when QEMU is run on the fastest bare-metal available, the slowest Arm hardware will beat it by minutes.</p>\n<h2 id=\"wrapping-up\">Wrapping up</h2>\n<p>Building your projects with Nix allows your GitHub actions pipelines to be concise and easy to maintain.</p>\n<p>Even when you are not using Nix to build your project it can still help you to create concise and easy to maintain GitHub Action workflows. With Nix shell environments you can use Nix to declare which dependencies you want to make available inside an isolated shell environment for your project: <a href=\"https://determinate.systems/posts/nix-github-actions\">Streamline your GitHub Actions dependencies using Nix</a></p>\n<p>Building Nix packages or entire NixOS systems on GitHub Actions can be slow especially if you need to build for Arm. Bringing your own metal to GitHub actions can speed up your builds. If you need Arm runners, Actuated is one of the only options for securely isolated CI that is safe for Open Source and public repositories. Alex explains why in: <a href=\"https://actuated.dev/blog/is-the-self-hosted-runner-safe-github-actions\">Is the GitHub Actions self-hosted runner safe for Open Source?</a></p>\n<p>Another powerful feature of the Nix ecosystem is the ability to run integration tests using virtual machines (NixOS test). This feature requires hardware acceleration to be available in the CI runner. Actuated makes it possible to run these tests in GitHub Actions CI pipelines: <a href=\"https://actuated.dev/blog/kvm-in-github-actions\">how to run KVM guests in your GitHub Actions</a>.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://actuated.dev/blog/case-study-bring-your-own-bare-metal-to-actions\">Bring Your Own Metal - Case Study with GitHub Actions</a></li>\n<li><a href=\"https://actuated.dev/blog/native-arm64-for-github-actions\">How to make GitHub Actions 22x faster with bare-metal Arm</a></li>\n</ul>","title":"Faster Nix builds with GitHub Actions and actuated","description":"Speed up your Nix project builds on GitHub Actions with runners powered by Firecracker.","tags":["cicd","githubactions","nix","nixos","faasd","openfaas"],"author_img":"welteki","image":"/images/2023-06-faster-nix-builds/background.png","date":"2023-06-12"}},"__N_SSG":true}